EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
/*
 * Copyright 2017-2021 Emcraft Systems
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 */

#ifndef __DTS_IMXRT117X_PINFUNC_H
#define __DTS_IMXRT117X_PINFUNC_H

#define IMXRT117X_EMC_PAD_PDRV_HIGH		(0x0 << 1)
#define IMXRT117X_EMC_PAD_PDRV_NORMAL		(0x1 << 1)

#define IMXRT117X_EMC_PAD_PULL_FORBIDDEN	(0x0 << 2)
#define IMXRT117X_EMC_PAD_PULL_UP		(0x1 << 2)
#define IMXRT117X_EMC_PAD_PULL_DOWN		(0x2 << 2)
#define IMXRT117X_EMC_PAD_PULL_NO		(0x3 << 2)

#define IMXRT117X_EMC_PAD_ODE_DISABLE		(0x0 << 4)
#define IMXRT117X_EMC_PAD_ODE_ENABLE		(0x1 << 4)

#define IMXRT117X_AD_PAD_SRE			(0x1 << 0)
#define IMXRT117X_AD_PAD_DSE			(0x1 << 1)
#define IMXRT117X_AD_PAD_PUE			(0x1 << 2)
#define IMXRT117X_AD_PAD_PUS			(0x1 << 3)
#define IMXRT117X_AD_PAD_ODE			(0x1 << 4)

#define IMXRT117X_PAD_CFG_UART			(IMXRT117X_AD_PAD_DSE)

/*
 * The pin function ID is a tuple of
 * <mux_reg conf_reg input_reg mux_mode input_val>
 */

#define IMXRT117X_PAD_EMC_B1_00_SEMC_DATA00		0x0010 0x0254 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_00_FLEXPWM4_PWM0_A		0x0010 0x0254 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_00_GPIO_MUX1_IO00		0x0010 0x0254 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_00_FLEXIO1_D00		0x0010 0x0254 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_00_GPIO7_IO00		0x0010 0x0254 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_01_GPIO7_IO01		0x0014 0x0258 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_01_SEMC_DATA01		0x0014 0x0258 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_01_FLEXPWM4_PWM0_B		0x0014 0x0258 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_01_GPIO_MUX1_IO01		0x0014 0x0258 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_01_FLEXIO1_D01		0x0014 0x0258 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_02_SEMC_DATA02		0x0018 0x025C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_02_FLEXPWM4_PWM1_A		0x0018 0x025C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_02_GPIO_MUX1_IO02		0x0018 0x025C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_02_FLEXIO1_D02		0x0018 0x025C 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_02_GPIO7_IO02		0x0018 0x025C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_03_SEMC_DATA03		0x001C 0x0260 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_03_FLEXPWM4_PWM1_B		0x001C 0x0260 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_03_GPIO_MUX1_IO03		0x001C 0x0260 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_03_FLEXIO1_D03		0x001C 0x0260 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_03_GPIO7_IO03		0x001C 0x0260 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_04_GPIO7_IO04		0x0020 0x0264 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_04_SEMC_DATA04		0x0020 0x0264 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_04_FLEXPWM4_PWM2_A		0x0020 0x0264 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_04_GPIO_MUX1_IO04		0x0020 0x0264 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_04_FLEXIO1_D04		0x0020 0x0264 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_05_SEMC_DATA05		0x0024 0x0268 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_05_FLEXPWM4_PWM2_B		0x0024 0x0268 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_05_GPIO_MUX1_IO05		0x0024 0x0268 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_05_FLEXIO1_D05		0x0024 0x0268 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_05_GPIO7_IO05		0x0024 0x0268 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_06_SEMC_DATA06		0x0028 0x026C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_06_FLEXPWM2_PWM0_A		0x0028 0x026C 0x0518 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_06_GPIO_MUX1_IO06		0x0028 0x026C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_06_FLEXIO1_D06		0x0028 0x026C 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_06_GPIO7_IO06		0x0028 0x026C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_07_GPIO7_IO07		0x002C 0x0270 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_07_SEMC_DATA07		0x002C 0x0270 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_07_FLEXPWM2_PWM0_B		0x002C 0x0270 0x0524 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_07_GPIO_MUX1_IO07		0x002C 0x0270 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_07_FLEXIO1_D07		0x002C 0x0270 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_08_SEMC_DM00		0x0030 0x0274 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_08_FLEXPWM2_PWM1_A		0x0030 0x0274 0x051C 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_08_GPIO_MUX1_IO08		0x0030 0x0274 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_08_FLEXIO1_D08		0x0030 0x0274 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_08_GPIO7_IO08		0x0030 0x0274 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_09_SEMC_ADDR00		0x0034 0x0278 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_09_FLEXPWM2_PWM1_B		0x0034 0x0278 0x0528 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_09_GPT5_CAPTURE1		0x0034 0x0278 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_09_GPIO_MUX1_IO09		0x0034 0x0278 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_09_FLEXIO1_D09		0x0034 0x0278 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_09_GPIO7_IO09		0x0034 0x0278 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_10_SEMC_ADDR01		0x0038 0x027C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_10_FLEXPWM2_PWM2_A		0x0038 0x027C 0x0520 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_10_GPT5_CAPTURE2		0x0038 0x027C 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_10_GPIO_MUX1_IO10		0x0038 0x027C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_10_FLEXIO1_D10		0x0038 0x027C 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_10_GPIO7_IO10		0x0038 0x027C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_11_GPIO7_IO11		0x003C 0x0280 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_11_SEMC_ADDR02		0x003C 0x0280 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_11_FLEXPWM2_PWM2_B		0x003C 0x0280 0x052C 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_11_GPT5_COMPARE1		0x003C 0x0280 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_11_GPIO_MUX1_IO11		0x003C 0x0280 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_11_FLEXIO1_D11		0x003C 0x0280 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_12_SEMC_ADDR03		0x0040 0x0284 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_12_XBAR1_INOUT04		0x0040 0x0284 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_12_GPT5_COMPARE2		0x0040 0x0284 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_12_GPIO_MUX1_IO12		0x0040 0x0284 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_12_FLEXIO1_D12		0x0040 0x0284 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_12_GPIO7_IO12		0x0040 0x0284 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_13_SEMC_ADDR04		0x0044 0x0288 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_13_XBAR1_INOUT05		0x0044 0x0288 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_13_GPT5_COMPARE3		0x0044 0x0288 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_13_GPIO_MUX1_IO13		0x0044 0x0288 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_13_FLEXIO1_D13		0x0044 0x0288 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_13_GPIO7_IO13		0x0044 0x0288 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_14_GPIO7_IO14		0x0048 0x028C 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_14_SEMC_ADDR05		0x0048 0x028C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_14_XBAR1_INOUT06		0x0048 0x028C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_14_GPT5_CLK		0x0048 0x028C 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_14_GPIO_MUX1_IO14		0x0048 0x028C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_14_FLEXIO1_D14		0x0048 0x028C 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_15_SEMC_ADDR06		0x004C 0x0290 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_15_XBAR1_INOUT07		0x004C 0x0290 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_15_GPIO_MUX1_IO15		0x004C 0x0290 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_15_FLEXIO1_D15		0x004C 0x0290 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_15_GPIO7_IO15		0x004C 0x0290 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_16_SEMC_ADDR07		0x0050 0x0294 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_16_XBAR1_INOUT08		0x0050 0x0294 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_16_GPIO_MUX1_IO16		0x0050 0x0294 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_16_FLEXIO1_D16		0x0050 0x0294 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_16_GPIO7_IO16		0x0050 0x0294 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_17_GPIO7_IO17		0x0054 0x0298 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_17_SEMC_ADDR08		0x0054 0x0298 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_17_FLEXPWM4_PWM3_A		0x0054 0x0298 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_17_TMR1_TIMER0		0x0054 0x0298 0x063C 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_17_GPIO_MUX1_IO17		0x0054 0x0298 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_17_FLEXIO1_D17		0x0054 0x0298 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_18_SEMC_ADDR09		0x0058 0x029C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_18_FLEXPWM4_PWM3_B		0x0058 0x029C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_18_TMR2_TIMER0		0x0058 0x029C 0x0648 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_18_GPIO_MUX1_IO18		0x0058 0x029C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_18_FLEXIO1_D18		0x0058 0x029C 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_18_GPIO7_IO18		0x0058 0x029C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_19_SEMC_ADDR11		0x005C 0x02A0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_19_FLEXPWM2_PWM3_A		0x005C 0x02A0 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_19_TMR3_TIMER0		0x005C 0x02A0 0x0654 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_19_GPIO_MUX1_IO19		0x005C 0x02A0 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_19_FLEXIO1_D19		0x005C 0x02A0 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_19_GPIO7_IO19		0x005C 0x02A0 0x0000 0xA 0x0

