EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_EMC_B1_20_SEMC_ADDR12		0x0060 0x02A4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_20_FLEXPWM2_PWM3_B		0x0060 0x02A4 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_20_TMR4_TIMER0		0x0060 0x02A4 0x0660 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_20_GPIO_MUX1_IO20		0x0060 0x02A4 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_20_FLEXIO1_D20		0x0060 0x02A4 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_20_GPIO7_IO20		0x0060 0x02A4 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_21_GPIO7_IO21		0x0064 0x02A8 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_21_SEMC_BA0		0x0064 0x02A8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_21_FLEXPWM3_PWM3_A		0x0064 0x02A8 0x053C 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_21_GPIO_MUX1_IO21		0x0064 0x02A8 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_21_FLEXIO1_D21		0x0064 0x02A8 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_22_GPIO7_IO22		0x0068 0x02AC 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_22_SEMC_BA1		0x0068 0x02AC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_22_FLEXPWM3_PWM3_B		0x0068 0x02AC 0x054C 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_22_GPIO_MUX1_IO22		0x0068 0x02AC 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_22_FLEXIO1_D22		0x0068 0x02AC 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_23_SEMC_ADDR10		0x006C 0x02B0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_23_FLEXPWM1_PWM0_A		0x006C 0x02B0 0x0500 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_23_GPIO_MUX1_IO23		0x006C 0x02B0 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_23_FLEXIO1_D23		0x006C 0x02B0 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_23_GPIO7_IO23		0x006C 0x02B0 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_24_GPIO7_IO24		0x0070 0x02B4 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_24_SEMC_CAS		0x0070 0x02B4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_24_FLEXPWM1_PWM0_B		0x0070 0x02B4 0x050C 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_24_GPIO_MUX1_IO24		0x0070 0x02B4 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_24_FLEXIO1_D24		0x0070 0x02B4 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_25_GPIO7_IO25		0x0074 0x02B8 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_25_SEMC_RAS		0x0074 0x02B8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_25_FLEXPWM1_PWM1_A		0x0074 0x02B8 0x0504 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_25_GPIO_MUX1_IO25		0x0074 0x02B8 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_25_FLEXIO1_D25		0x0074 0x02B8 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_26_SEMC_CLK		0x0078 0x02BC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_26_FLEXPWM1_PWM1_B		0x0078 0x02BC 0x0510 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_26_GPIO_MUX1_IO26		0x0078 0x02BC 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_26_FLEXIO1_D26		0x0078 0x02BC 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_26_GPIO7_IO26		0x0078 0x02BC 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_27_GPIO7_IO27		0x007C 0x02C0 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_27_SEMC_CKE		0x007C 0x02C0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_27_FLEXPWM1_PWM2_A		0x007C 0x02C0 0x0508 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_27_GPIO_MUX1_IO27		0x007C 0x02C0 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_27_FLEXIO1_D27		0x007C 0x02C0 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_28_GPIO7_IO28		0x0080 0x02C4 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_28_SEMC_WE			0x0080 0x02C4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_28_FLEXPWM1_PWM2_B		0x0080 0x02C4 0x0514 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_28_GPIO_MUX1_IO28		0x0080 0x02C4 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_28_FLEXIO1_D28		0x0080 0x02C4 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_29_SEMC_CS0		0x0084 0x02C8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_29_FLEXPWM3_PWM0_A		0x0084 0x02C8 0x0530 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_29_GPIO_MUX1_IO29		0x0084 0x02C8 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_29_FLEXIO1_D29		0x0084 0x02C8 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_29_GPIO7_IO29		0x0084 0x02C8 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_30_SEMC_DATA08		0x0088 0x02CC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_30_FLEXPWM3_PWM0_B		0x0088 0x02CC 0x0540 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_30_GPIO_MUX1_IO30		0x0088 0x02CC 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_30_FLEXIO1_D30		0x0088 0x02CC 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B1_30_GPIO7_IO30		0x0088 0x02CC 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_31_GPIO7_IO31		0x008C 0x02D0 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_31_SEMC_DATA09		0x008C 0x02D0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_31_FLEXPWM3_PWM1_A		0x008C 0x02D0 0x0534 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_31_GPIO_MUX1_IO31		0x008C 0x02D0 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_31_FLEXIO1_D31		0x008C 0x02D0 0x0000 0x8 0x0

#define IMXRT117X_PAD_EMC_B1_32_GPIO8_IO00		0x0090 0x02D4 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_32_SEMC_DATA10		0x0090 0x02D4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_32_FLEXPWM3_PWM1_B		0x0090 0x02D4 0x0544 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_32_GPIO_MUX2_IO00		0x0090 0x02D4 0x0000 0x5 0x0

#define IMXRT117X_PAD_EMC_B1_33_SEMC_DATA11		0x0094 0x02D8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_33_FLEXPWM3_PWM2_A		0x0094 0x02D8 0x0538 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_33_GPIO_MUX2_IO01		0x0094 0x02D8 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_33_GPIO8_IO01		0x0094 0x02D8 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_34_GPIO8_IO02		0x0098 0x02DC 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_34_SEMC_DATA12		0x0098 0x02DC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_34_FLEXPWM3_PWM2_B		0x0098 0x02DC 0x0548 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_34_GPIO_MUX2_IO02		0x0098 0x02DC 0x0000 0x5 0x0

#define IMXRT117X_PAD_EMC_B1_35_GPIO8_IO03		0x009C 0x02E0 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_35_SEMC_DATA13		0x009C 0x02E0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_35_XBAR1_INOUT09		0x009C 0x02E0 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_35_GPIO_MUX2_IO03		0x009C 0x02E0 0x0000 0x5 0x0

#define IMXRT117X_PAD_EMC_B1_36_SEMC_DATA14		0x00A0 0x02E4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_36_XBAR1_INOUT10		0x00A0 0x02E4 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_36_GPIO_MUX2_IO04		0x00A0 0x02E4 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_36_GPIO8_IO04		0x00A0 0x02E4 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_37_GPIO8_IO05		0x00A4 0x02E8 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_37_SEMC_DATA15		0x00A4 0x02E8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_37_XBAR1_INOUT11		0x00A4 0x02E8 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_37_GPIO_MUX2_IO05		0x00A4 0x02E8 0x0000 0x5 0x0

