EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_EMC_B1_38_GPIO8_IO06		0x00A8 0x02EC 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_38_SEMC_DM01		0x00A8 0x02EC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_38_FLEXPWM1_PWM3_A		0x00A8 0x02EC 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_38_TMR1_TIMER1		0x00A8 0x02EC 0x0640 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_38_GPIO_MUX2_IO06		0x00A8 0x02EC 0x0000 0x5 0x0

#define IMXRT117X_PAD_EMC_B1_39_SEMC_DQS		0x00AC 0x02F0 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_39_FLEXPWM1_PWM3_B		0x00AC 0x02F0 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_39_TMR2_TIMER1		0x00AC 0x02F0 0x064C 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_39_GPIO_MUX2_IO07		0x00AC 0x02F0 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_39_GPIO8_IO07		0x00AC 0x02F0 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_40_SEMC_RDY		0x00B0 0x02F4 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_40_XBAR1_INOUT12		0x00B0 0x02F4 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_40_MQS_RIGHT		0x00B0 0x02F4 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_40_LPUART6_TXD		0x00B0 0x02F4 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B1_40_GPIO_MUX2_IO08		0x00B0 0x02F4 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_40_ENET_1G_MDC		0x00B0 0x02F4 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B1_40_CCM_CLKO1		0x00B0 0x02F4 0x0000 0x9 0x0
#define IMXRT117X_PAD_EMC_B1_40_GPIO8_IO08		0x00B0 0x02F4 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B1_41_GPIO8_IO09		0x00B4 0x02F8 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B1_41_SEMC_CSX00		0x00B4 0x02F8 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B1_41_XBAR1_INOUT13		0x00B4 0x02F8 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B1_41_MQS_LEFT		0x00B4 0x02F8 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B1_41_LPUART6_RXD		0x00B4 0x02F8 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B1_41_FLEXSPI2_B_DATA07	0x00B4 0x02F8 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B1_41_GPIO_MUX2_IO09		0x00B4 0x02F8 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B1_41_ENET_1G_MDIO		0x00B4 0x02F8 0x04C8 0x7 0x0
#define IMXRT117X_PAD_EMC_B1_41_CCM_CLKO2		0x00B4 0x02F8 0x0000 0x9 0x0

#define IMXRT117X_PAD_EMC_B2_00_SEMC_DATA16		0x00B8 0x02FC 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_00_CCM_ENET_REF_CLK_25M	0x00B8 0x02FC 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_00_TMR3_TIMER1		0x00B8 0x02FC 0x0658 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_00_LPUART6_CTS_B		0x00B8 0x02FC 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_00_FLEXSPI2_B_DATA06	0x00B8 0x02FC 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_00_GPIO_MUX2_IO10		0x00B8 0x02FC 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_00_XBAR1_INOUT20		0x00B8 0x02FC 0x06D8 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_00_ENET_QOS_1588_EVENT1_OUT	0x00B8 0x02FC 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_00_LPSPI1_SCK		0x00B8 0x02FC 0x05D0 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_00_LPI2C2_SCL		0x00B8 0x02FC 0x05B4 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_00_GPIO8_IO10		0x00B8 0x02FC 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_00_FLEXPWM3_PWM0_A		0x00B8 0x02FC 0x0530 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_01_SEMC_DATA17		0x00BC 0x0300 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_01_USDHC2_CD_B		0x00BC 0x0300 0x06D0 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_01_TMR4_TIMER1		0x00BC 0x0300 0x0664 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_01_LPUART6_RTS_B		0x00BC 0x0300 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_01_FLEXSPI2_B_DATA05	0x00BC 0x0300 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_01_GPIO_MUX2_IO11		0x00BC 0x0300 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_01_XBAR1_INOUT21		0x00BC 0x0300 0x06DC 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_01_ENET_QOS_1588_EVENT1_IN	0x00BC 0x0300 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_01_LPSPI1_PCS0		0x00BC 0x0300 0x05CC 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_01_LPI2C2_SDA		0x00BC 0x0300 0x05B8 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_01_GPIO8_IO11		0x00BC 0x0300 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_01_FLEXPWM3_PWM0_B		0x00BC 0x0300 0x0540 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_02_SEMC_DATA18		0x00C0 0x0304 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_02_USDHC2_WP		0x00C0 0x0304 0x06D4 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_02_VIDEO_MUX_CSI_DATA23	0x00C0 0x0304 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_02_FLEXSPI2_B_DATA04	0x00C0 0x0304 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_02_GPIO_MUX2_IO12		0x00C0 0x0304 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_02_XBAR1_INOUT22		0x00C0 0x0304 0x06E0 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_02_ENET_QOS_1588_EVENT1_AUX_IN	0x00C0 0x0304 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_02_LPSPI1_SOUT		0x00C0 0x0304 0x05D8 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_02_GPIO8_IO12		0x00C0 0x0304 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_02_FLEXPWM3_PWM1_A		0x00C0 0x0304 0x0534 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_03_SEMC_DATA19		0x00C4 0x0308 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_03_USDHC2_VSELECT		0x00C4 0x0308 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_03_VIDEO_MUX_CSI_DATA22	0x00C4 0x0308 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_03_FLEXSPI2_B_DATA03	0x00C4 0x0308 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_03_GPIO_MUX2_IO13		0x00C4 0x0308 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_03_XBAR1_INOUT23		0x00C4 0x0308 0x06E4 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_03_ENET_1G_TX_DATA03	0x00C4 0x0308 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_03_LPSPI1_SIN		0x00C4 0x0308 0x05D4 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_03_GPIO8_IO13		0x00C4 0x0308 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_03_FLEXPWM3_PWM1_B		0x00C4 0x0308 0x0544 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_04_SEMC_DATA20		0x00C8 0x030C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_04_USDHC2_RESET_B		0x00C8 0x030C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_04_SAI2_MCLK		0x00C8 0x030C 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_04_VIDEO_MUX_CSI_DATA21	0x00C8 0x030C 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_04_FLEXSPI2_B_DATA02	0x00C8 0x030C 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_04_GPIO_MUX2_IO14		0x00C8 0x030C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_04_XBAR1_INOUT24		0x00C8 0x030C 0x06E8 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_04_ENET_1G_TX_DATA02	0x00C8 0x030C 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_04_LPSPI3_SCK		0x00C8 0x030C 0x0600 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_04_GPIO8_IO14		0x00C8 0x030C 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_04_FLEXPWM3_PWM2_A		0x00C8 0x030C 0x0538 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_05_SEMC_DATA21		0x00CC 0x0310 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_05_GPT3_CLK		0x00CC 0x0310 0x0598 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_05_SAI2_RX_SYNC		0x00CC 0x0310 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_05_VIDEO_MUX_CSI_DATA20	0x00CC 0x0310 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_05_FLEXSPI2_B_DATA01	0x00CC 0x0310 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_05_GPIO_MUX2_IO15		0x00CC 0x0310 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_05_XBAR1_INOUT25		0x00CC 0x0310 0x06EC 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_05_ENET_1G_RX_CLK		0x00CC 0x0310 0x04CC 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_05_LPSPI3_PCS0		0x00CC 0x0310 0x05F0 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_05_PIT1_TRIGGER0		0x00CC 0x0310 0x0000 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_05_GPIO8_IO15		0x00CC 0x0310 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_05_FLEXPWM3_PWM2_B		0x00CC 0x0310 0x0548 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_06_SEMC_DATA22		0x00D0 0x0314 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_06_GPT3_CAPTURE1		0x00D0 0x0314 0x0590 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_06_GPIO8_IO16		0x00D0 0x0314 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_06_SAI2_RX_BCLK		0x00D0 0x0314 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_06_FLEXPWM3_PWM3_A		0x00D0 0x0314 0x053C 0xB 0x1
#define IMXRT117X_PAD_EMC_B2_06_VIDEO_MUX_CSI_DATA19	0x00D0 0x0314 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_06_FLEXSPI2_B_DATA00	0x00D0 0x0314 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_06_GPIO_MUX2_IO16		0x00D0 0x0314 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_06_XBAR1_INOUT26		0x00D0 0x0314 0x06F0 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_06_ENET_1G_TX_ER		0x00D0 0x0314 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_06_LPSPI3_SOUT		0x00D0 0x0314 0x0608 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_06_PIT1_TRIGGER1		0x00D0 0x0314 0x0000 0x9 0x0

#define IMXRT117X_PAD_EMC_B2_07_SEMC_DATA23		0x00D4 0x0318 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_07_GPT3_CAPTURE2		0x00D4 0x0318 0x0594 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_07_SAI2_RX_DATA		0x00D4 0x0318 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_07_VIDEO_MUX_CSI_DATA18	0x00D4 0x0318 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_07_FLEXSPI2_B_DQS		0x00D4 0x0318 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_07_GPIO_MUX2_IO17		0x00D4 0x0318 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_07_XBAR1_INOUT27		0x00D4 0x0318 0x06F4 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_07_ENET_1G_RX_DATA03	0x00D4 0x0318 0x04DC 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_07_LPSPI3_SIN		0x00D4 0x0318 0x0604 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_07_PIT1_TRIGGER2		0x00D4 0x0318 0x0000 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_07_GPIO8_IO17		0x00D4 0x0318 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_07_FLEXPWM3_PWM3_B		0x00D4 0x0318 0x054C 0xB 0x1

#define IMXRT117X_PAD_EMC_B2_08_SEMC_DM02		0x00D8 0x031C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_08_GPT3_COMPARE1		0x00D8 0x031C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_08_SAI2_TX_DATA		0x00D8 0x031C 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_08_VIDEO_MUX_CSI_DATA17	0x00D8 0x031C 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_08_FLEXSPI2_B_SS0_B	0x00D8 0x031C 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_08_GPIO_MUX2_IO18		0x00D8 0x031C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_08_XBAR1_INOUT28		0x00D8 0x031C 0x06F8 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_08_ENET_1G_RX_DATA02	0x00D8 0x031C 0x04D8 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_08_LPSPI3_PCS1		0x00D8 0x031C 0x05F4 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_08_PIT1_TRIGGER3		0x00D8 0x031C 0x0000 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_08_GPIO8_IO18		0x00D8 0x031C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_09_GPIO8_IO19		0x00DC 0x0320 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_09_SEMC_DATA24		0x00DC 0x0320 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_09_GPT3_COMPARE2		0x00DC 0x0320 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_09_SAI2_TX_BCLK		0x00DC 0x0320 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_09_VIDEO_MUX_CSI_DATA16	0x00DC 0x0320 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_09_FLEXSPI2_B_SCLK		0x00DC 0x0320 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_09_GPIO_MUX2_IO19		0x00DC 0x0320 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_09_XBAR1_INOUT29		0x00DC 0x0320 0x06FC 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_09_ENET_1G_CRS		0x00DC 0x0320 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_09_LPSPI3_PCS2		0x00DC 0x0320 0x05F8 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_09_TMR1_TIMER0		0x00DC 0x0320 0x063C 0x9 0x1

#define IMXRT117X_PAD_EMC_B2_10_GPIO8_IO20		0x00E0 0x0324 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_10_SEMC_DATA25		0x00E0 0x0324 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_10_GPT3_COMPARE3		0x00E0 0x0324 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_10_SAI2_TX_SYNC		0x00E0 0x0324 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_10_VIDEO_MUX_CSI_FIELD	0x00E0 0x0324 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_10_FLEXSPI2_A_SCLK		0x00E0 0x0324 0x058C 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_10_GPIO_MUX2_IO20		0x00E0 0x0324 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_10_XBAR1_INOUT30		0x00E0 0x0324 0x0700 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_10_ENET_1G_COL		0x00E0 0x0324 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_10_LPSPI3_PCS3		0x00E0 0x0324 0x05FC 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_10_TMR1_TIMER1		0x00E0 0x0324 0x0640 0x9 0x1

