EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_EMC_B2_11_SEMC_DATA26		0x00E4 0x0328 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_11_SPDIF_IN		0x00E4 0x0328 0x06B4 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_11_ENET_1G_TX_DATA00	0x00E4 0x0328 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_11_SAI3_RX_SYNC		0x00E4 0x0328 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_11_FLEXSPI2_A_SS0_B	0x00E4 0x0328 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_11_GPIO_MUX2_IO21		0x00E4 0x0328 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_11_XBAR1_INOUT31		0x00E4 0x0328 0x0704 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_11_EMVSIM1_IO		0x00E4 0x0328 0x069C 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_11_TMR1_TIMER2		0x00E4 0x0328 0x0644 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_11_GPIO8_IO21		0x00E4 0x0328 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_12_SEMC_DATA27		0x00E8 0x032C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_12_SPDIF_OUT		0x00E8 0x032C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_12_ENET_1G_TX_DATA01	0x00E8 0x032C 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_12_SAI3_RX_BCLK		0x00E8 0x032C 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_12_FLEXSPI2_A_DQS		0x00E8 0x032C 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_12_GPIO_MUX2_IO22		0x00E8 0x032C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_12_XBAR1_INOUT32		0x00E8 0x032C 0x0708 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_12_EMVSIM1_CLK		0x00E8 0x032C 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_12_TMR1_TIMER3		0x00E8 0x032C 0x0000 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_12_GPIO8_IO22		0x00E8 0x032C 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_13_GPIO8_IO23		0x00EC 0x0330 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_13_SEMC_DATA28		0x00EC 0x0330 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_13_ENET_1G_TX_EN		0x00EC 0x0330 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_13_SAI3_RX_DATA		0x00EC 0x0330 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_13_FLEXSPI2_A_DATA00	0x00EC 0x0330 0x057C 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_13_GPIO_MUX2_IO23		0x00EC 0x0330 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_13_XBAR1_INOUT33		0x00EC 0x0330 0x070C 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_13_EMVSIM1_RST		0x00EC 0x0330 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_13_TMR2_TIMER0		0x00EC 0x0330 0x0648 0x9 0x1

#define IMXRT117X_PAD_EMC_B2_14_SEMC_DATA29		0x00F0 0x0334 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_14_ENET_1G_TX_CLK_IO	0x00F0 0x0334 0x04E8 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_14_SAI3_TX_DATA		0x00F0 0x0334 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_14_FLEXSPI2_A_DATA01	0x00F0 0x0334 0x0580 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_14_GPIO_MUX2_IO24		0x00F0 0x0334 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_14_XBAR1_INOUT34		0x00F0 0x0334 0x0710 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_14_SFA_ipp_do_atx_clk_under_test	0x00F0 0x0334 0x0000 0x7 0x0
#define IMXRT117X_PAD_EMC_B2_14_EMVSIM1_SVEN		0x00F0 0x0334 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_14_TMR2_TIMER1		0x00F0 0x0334 0x064C 0x9 0x1
#define IMXRT117X_PAD_EMC_B2_14_GPIO8_IO24		0x00F0 0x0334 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_15_SEMC_DATA30		0x00F4 0x0338 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_15_ENET_1G_RX_DATA00	0x00F4 0x0338 0x04D0 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_15_SAI3_TX_BCLK		0x00F4 0x0338 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_15_FLEXSPI2_A_DATA02	0x00F4 0x0338 0x0584 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_15_GPIO_MUX2_IO25		0x00F4 0x0338 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_15_XBAR1_INOUT35		0x00F4 0x0338 0x0714 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_15_EMVSIM1_PD		0x00F4 0x0338 0x06A0 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_15_TMR2_TIMER2		0x00F4 0x0338 0x0650 0x9 0x0
#define IMXRT117X_PAD_EMC_B2_15_GPIO8_IO25		0x00F4 0x0338 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_16_GPIO8_IO26		0x00F8 0x033C 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_16_SEMC_DATA31		0x00F8 0x033C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_16_XBAR1_INOUT14		0x00F8 0x033C 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_16_ENET_1G_RX_DATA01	0x00F8 0x033C 0x04D4 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_16_SAI3_TX_SYNC		0x00F8 0x033C 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_16_FLEXSPI2_A_DATA03	0x00F8 0x033C 0x0588 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_16_GPIO_MUX2_IO26		0x00F8 0x033C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_16_EMVSIM1_POWER_FAIL	0x00F8 0x033C 0x06A4 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_16_TMR2_TIMER3		0x00F8 0x033C 0x0000 0x9 0x0

#define IMXRT117X_PAD_EMC_B2_17_SEMC_DM03		0x00FC 0x0340 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_17_XBAR1_INOUT15		0x00FC 0x0340 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_17_ENET_1G_RX_EN		0x00FC 0x0340 0x04E0 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_17_SAI3_MCLK		0x00FC 0x0340 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_17_FLEXSPI2_A_DATA04	0x00FC 0x0340 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_17_GPIO_MUX2_IO27		0x00FC 0x0340 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_17_WDOG1_ANY		0x00FC 0x0340 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_17_TMR3_TIMER0		0x00FC 0x0340 0x0654 0x9 0x1
#define IMXRT117X_PAD_EMC_B2_17_GPIO8_IO27		0x00FC 0x0340 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_18_SEMC_DQS4		0x0100 0x0344 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_18_XBAR1_INOUT16		0x0100 0x0344 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_18_ENET_1G_RX_ER		0x0100 0x0344 0x04E4 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_18_EWM_OUT_B		0x0100 0x0344 0x0000 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_18_FLEXSPI2_A_DATA05	0x0100 0x0344 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_18_GPIO_MUX2_IO28		0x0100 0x0344 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_18_FLEXSPI1_A_DQS		0x0100 0x0344 0x0550 0x6 0x0
#define IMXRT117X_PAD_EMC_B2_18_WDOG1_B			0x0100 0x0344 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_18_TMR3_TIMER1		0x0100 0x0344 0x0658 0x9 0x1
#define IMXRT117X_PAD_EMC_B2_18_GPIO8_IO28		0x0100 0x0344 0x0000 0xA 0x0

#define IMXRT117X_PAD_EMC_B2_19_GPIO8_IO29		0x0104 0x0348 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_19_SEMC_CLKX00		0x0104 0x0348 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_19_ENET_MDC		0x0104 0x0348 0x0000 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_19_ENET_1G_MDC		0x0104 0x0348 0x0000 0x2 0x0
#define IMXRT117X_PAD_EMC_B2_19_ENET_1G_REF_CLK		0x0104 0x0348 0x04C4 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_19_FLEXSPI2_A_DATA06	0x0104 0x0348 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_19_GPIO_MUX2_IO29		0x0104 0x0348 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_19_ENET_QOS_MDC		0x0104 0x0348 0x0000 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_19_TMR3_TIMER2		0x0104 0x0348 0x065C 0x9 0x0

#define IMXRT117X_PAD_EMC_B2_20_GPIO8_IO30		0x0108 0x034C 0x0000 0xA 0x0
#define IMXRT117X_PAD_EMC_B2_20_SEMC_CLKX01		0x0108 0x034C 0x0000 0x0 0x0
#define IMXRT117X_PAD_EMC_B2_20_ENET_MDIO		0x0108 0x034C 0x04AC 0x1 0x0
#define IMXRT117X_PAD_EMC_B2_20_ENET_1G_MDIO		0x0108 0x034C 0x04C8 0x2 0x1
#define IMXRT117X_PAD_EMC_B2_20_ENET_QOS_REF_CLK	0x0108 0x034C 0x04A0 0x3 0x0
#define IMXRT117X_PAD_EMC_B2_20_FLEXSPI2_A_DATA07	0x0108 0x034C 0x0000 0x4 0x0
#define IMXRT117X_PAD_EMC_B2_20_GPIO_MUX2_IO30		0x0108 0x034C 0x0000 0x5 0x0
#define IMXRT117X_PAD_EMC_B2_20_ENET_QOS_MDIO		0x0108 0x034C 0x04EC 0x8 0x0
#define IMXRT117X_PAD_EMC_B2_20_TMR3_TIMER3		0x0108 0x034C 0x0000 0x9 0x0

