EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_AD_00_GPIO8_IO31			0x010C 0x0350 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_00_EMVSIM1_IO			0x010C 0x0350 0x069C 0x0 0x1
#define IMXRT117X_PAD_AD_00_FLEXCAN2_TX			0x010C 0x0350 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_00_ENET_1G_1588_EVENT1_IN	0x010C 0x0350 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_00_GPT2_CAPTURE1		0x010C 0x0350 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_00_FLEXPWM1_PWM0_A		0x010C 0x0350 0x0500 0x4 0x1
#define IMXRT117X_PAD_AD_00_GPIO_MUX2_IO31		0x010C 0x0350 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_00_LPUART7_TXD			0x010C 0x0350 0x0630 0x6 0x0
#define IMXRT117X_PAD_AD_00_FLEXIO2_D00			0x010C 0x0350 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_00_FLEXSPI2_B_SS1_B		0x010C 0x0350 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_01_GPIO9_IO00			0x0110 0x0354 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_01_EMVSIM1_CLK			0x0110 0x0354 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_01_FLEXCAN2_RX			0x0110 0x0354 0x049C 0x1 0x0
#define IMXRT117X_PAD_AD_01_ENET_1G_1588_EVENT1_OUT	0x0110 0x0354 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_01_GPT2_CAPTURE2		0x0110 0x0354 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_01_FLEXPWM1_PWM0_B		0x0110 0x0354 0x050C 0x4 0x1
#define IMXRT117X_PAD_AD_01_GPIO_MUX3_IO00		0x0110 0x0354 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_01_LPUART7_RXD			0x0110 0x0354 0x062C 0x6 0x0
#define IMXRT117X_PAD_AD_01_FLEXIO2_D01			0x0110 0x0354 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_01_FLEXSPI2_A_SS1_B		0x0110 0x0354 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_02_GPIO9_IO01			0x0114 0x0358 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_02_EMVSIM1_RST			0x0114 0x0358 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_02_LPUART7_CTS_B		0x0114 0x0358 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_02_ENET_1G_1588_EVENT2_IN	0x0114 0x0358 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_02_GPT2_COMPARE1		0x0114 0x0358 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_02_FLEXPWM1_PWM1_A		0x0114 0x0358 0x0504 0x4 0x1
#define IMXRT117X_PAD_AD_02_GPIO_MUX3_IO01		0x0114 0x0358 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_02_LPUART8_TXD			0x0114 0x0358 0x0638 0x6 0x0
#define IMXRT117X_PAD_AD_02_FLEXIO2_D02			0x0114 0x0358 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_02_VIDEO_MUX_EXT_DCIC1		0x0114 0x0358 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_03_GPIO9_IO02			0x0118 0x035C 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_03_EMVSIM1_SVEN		0x0118 0x035C 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_03_LPUART7_RTS_B		0x0118 0x035C 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_03_ENET_1G_1588_EVENT2_OUT	0x0118 0x035C 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_03_GPT2_COMPARE2		0x0118 0x035C 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_03_FLEXPWM1_PWM1_B		0x0118 0x035C 0x0510 0x4 0x1
#define IMXRT117X_PAD_AD_03_GPIO_MUX3_IO02		0x0118 0x035C 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_03_LPUART8_RXD			0x0118 0x035C 0x0634 0x6 0x0
#define IMXRT117X_PAD_AD_03_FLEXIO2_D03			0x0118 0x035C 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_03_VIDEO_MUX_EXT_DCIC2		0x0118 0x035C 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_04_EMVSIM1_PD			0x011C 0x0360 0x06A0 0x0 0x1
#define IMXRT117X_PAD_AD_04_LPUART8_CTS_B		0x011C 0x0360 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_04_ENET_1G_1588_EVENT3_IN	0x011C 0x0360 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_04_GPT2_COMPARE3		0x011C 0x0360 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_04_FLEXPWM1_PWM2_A		0x011C 0x0360 0x0508 0x4 0x1
#define IMXRT117X_PAD_AD_04_GPIO_MUX3_IO03		0x011C 0x0360 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_04_WDOG1_B			0x011C 0x0360 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_04_FLEXIO2_D04			0x011C 0x0360 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_04_TMR4_TIMER0			0x011C 0x0360 0x0660 0x9 0x1
#define IMXRT117X_PAD_AD_04_GPIO9_IO03			0x011C 0x0360 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_05_EMVSIM1_POWER_FAIL		0x0120 0x0364 0x06A4 0x0 0x1
#define IMXRT117X_PAD_AD_05_LPUART8_RTS_B		0x0120 0x0364 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_05_ENET_1G_1588_EVENT3_OUT	0x0120 0x0364 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_05_GPT2_CLK			0x0120 0x0364 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_05_FLEXPWM1_PWM2_B		0x0120 0x0364 0x0514 0x4 0x1
#define IMXRT117X_PAD_AD_05_GPIO_MUX3_IO04		0x0120 0x0364 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_05_WDOG2_B			0x0120 0x0364 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_05_FLEXIO2_D05			0x0120 0x0364 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_05_TMR4_TIMER1			0x0120 0x0364 0x0664 0x9 0x1
#define IMXRT117X_PAD_AD_05_GPIO9_IO04			0x0120 0x0364 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_06_USB_OTG2_OC			0x0124 0x0368 0x06B8 0x0 0x0
#define IMXRT117X_PAD_AD_06_FLEXCAN1_TX			0x0124 0x0368 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_06_EMVSIM2_IO			0x0124 0x0368 0x06A8 0x2 0x0
#define IMXRT117X_PAD_AD_06_GPT3_CAPTURE1		0x0124 0x0368 0x0590 0x3 0x1
#define IMXRT117X_PAD_AD_06_VIDEO_MUX_CSI_DATA15	0x0124 0x0368 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_06_GPIO_MUX3_IO05		0x0124 0x0368 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_06_ENET_1588_EVENT1_IN		0x0124 0x0368 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_06_FLEXIO2_D06			0x0124 0x0368 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_06_TMR4_TIMER2			0x0124 0x0368 0x0668 0x9 0x0
#define IMXRT117X_PAD_AD_06_GPIO9_IO05			0x0124 0x0368 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_06_FLEXPWM1_PWM0_X		0x0124 0x0368 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_07_USB_OTG2_PWR		0x0128 0x036C 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_07_FLEXCAN1_RX			0x0128 0x036C 0x0498 0x1 0x0
#define IMXRT117X_PAD_AD_07_EMVSIM2_CLK			0x0128 0x036C 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_07_GPT3_CAPTURE2		0x0128 0x036C 0x0594 0x3 0x1
#define IMXRT117X_PAD_AD_07_VIDEO_MUX_CSI_DATA14	0x0128 0x036C 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_07_GPIO_MUX3_IO06		0x0128 0x036C 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_07_ENET_1588_EVENT1_OUT	0x0128 0x036C 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_07_FLEXIO2_D07			0x0128 0x036C 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_07_TMR4_TIMER3			0x0128 0x036C 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_07_GPIO9_IO06			0x0128 0x036C 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_07_FLEXPWM1_PWM1_X		0x0128 0x036C 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_08_USBPHY2_OTG_ID		0x012C 0x0370 0x06C4 0x0 0x0
#define IMXRT117X_PAD_AD_08_LPI2C1_SCL			0x012C 0x0370 0x05AC 0x1 0x0
#define IMXRT117X_PAD_AD_08_EMVSIM2_RST			0x012C 0x0370 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_08_GPT3_COMPARE1		0x012C 0x0370 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_08_VIDEO_MUX_CSI_DATA13	0x012C 0x0370 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_08_GPIO_MUX3_IO07		0x012C 0x0370 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_08_ENET_1588_EVENT2_IN		0x012C 0x0370 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_08_FLEXIO2_D08			0x012C 0x0370 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_08_GPIO9_IO07			0x012C 0x0370 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_08_FLEXPWM1_PWM2_X		0x012C 0x0370 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_09_USBPHY1_OTG_ID		0x0130 0x0374 0x06C0 0x0 0x0
#define IMXRT117X_PAD_AD_09_LPI2C1_SDA			0x0130 0x0374 0x05B0 0x1 0x0
#define IMXRT117X_PAD_AD_09_EMVSIM2_SVEN		0x0130 0x0374 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_09_GPT3_COMPARE2		0x0130 0x0374 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_09_VIDEO_MUX_CSI_DATA12	0x0130 0x0374 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_09_GPIO_MUX3_IO08		0x0130 0x0374 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_09_ENET_1588_EVENT2_OUT	0x0130 0x0374 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_09_FLEXIO2_D09			0x0130 0x0374 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_09_GPIO9_IO08			0x0130 0x0374 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_09_FLEXPWM1_PWM3_X		0x0130 0x0374 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_10_USB_OTG1_PWR		0x0134 0x0378 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_10_LPI2C1_SCLS			0x0134 0x0378 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_10_EMVSIM2_PD			0x0134 0x0378 0x06AC 0x2 0x0
#define IMXRT117X_PAD_AD_10_GPT3_COMPARE3		0x0134 0x0378 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_10_VIDEO_MUX_CSI_DATA11	0x0134 0x0378 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_10_GPIO_MUX3_IO09		0x0134 0x0378 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_10_ENET_1588_EVENT3_IN		0x0134 0x0378 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_10_FLEXIO2_D10			0x0134 0x0378 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_10_GPIO9_IO09			0x0134 0x0378 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_10_FLEXPWM2_PWM0_X		0x0134 0x0378 0x0000 0xB 0x0

