EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_AD_11_USB_OTG1_OC			0x0138 0x037C 0x06BC 0x0 0x0
#define IMXRT117X_PAD_AD_11_LPI2C1_SDAS			0x0138 0x037C 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_11_EMVSIM2_POWER_FAIL		0x0138 0x037C 0x06B0 0x2 0x0
#define IMXRT117X_PAD_AD_11_GPT3_CLK			0x0138 0x037C 0x0598 0x3 0x1
#define IMXRT117X_PAD_AD_11_VIDEO_MUX_CSI_DATA10	0x0138 0x037C 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_11_GPIO_MUX3_IO10		0x0138 0x037C 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_11_ENET_1588_EVENT3_OUT	0x0138 0x037C 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_11_FLEXIO2_D11			0x0138 0x037C 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_11_GPIO9_IO10			0x0138 0x037C 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_11_FLEXPWM2_PWM1_X		0x0138 0x037C 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_12_SPDIF_LOCK			0x013C 0x0380 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_12_LPI2C1_HREQ			0x013C 0x0380 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_12_GPT1_CAPTURE1		0x013C 0x0380 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_12_FLEXSPI1_B_DATA03		0x013C 0x0380 0x0570 0x3 0x0
#define IMXRT117X_PAD_AD_12_VIDEO_MUX_CSI_PIXCLK	0x013C 0x0380 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_12_GPIO_MUX3_IO11		0x013C 0x0380 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_12_ENET_TX_DATA03		0x013C 0x0380 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_12_FLEXIO2_D12			0x013C 0x0380 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_12_EWM_OUT_B			0x013C 0x0380 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_12_GPIO9_IO11			0x013C 0x0380 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_12_FLEXPWM2_PWM2_X		0x013C 0x0380 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_13_SPDIF_SR_CLK		0x0140 0x0384 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_13_PIT1_TRIGGER0		0x0140 0x0384 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_13_GPT1_CAPTURE2		0x0140 0x0384 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_13_FLEXSPI1_B_DATA02		0x0140 0x0384 0x056C 0x3 0x0
#define IMXRT117X_PAD_AD_13_VIDEO_MUX_CSI_MCLK		0x0140 0x0384 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_13_GPIO_MUX3_IO12		0x0140 0x0384 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_13_ENET_TX_DATA02		0x0140 0x0384 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_13_FLEXIO2_D13			0x0140 0x0384 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_13_REF_CLK_32K			0x0140 0x0384 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_13_GPIO9_IO12			0x0140 0x0384 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_13_FLEXPWM2_PWM3_X		0x0140 0x0384 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_14_SPDIF_EXT_CLK		0x0144 0x0388 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_14_REF_CLK_24M			0x0144 0x0388 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_14_GPT1_COMPARE1		0x0144 0x0388 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_14_FLEXSPI1_B_DATA01		0x0144 0x0388 0x0568 0x3 0x0
#define IMXRT117X_PAD_AD_14_VIDEO_MUX_CSI_VSYNC		0x0144 0x0388 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_14_GPIO_MUX3_IO13		0x0144 0x0388 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_14_ENET_RX_CLK			0x0144 0x0388 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_14_FLEXIO2_D14			0x0144 0x0388 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_14_CCM_ENET_REF_CLK_25M	0x0144 0x0388 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_14_GPIO9_IO13			0x0144 0x0388 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_14_FLEXPWM3_PWM0_X		0x0144 0x0388 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_15_GPIO9_IO14			0x0148 0x038C 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_15_FLEXPWM3_PWM1_X		0x0148 0x038C 0x0000 0xB 0x0
#define IMXRT117X_PAD_AD_15_SPDIF_IN			0x0148 0x038C 0x06B4 0x0 0x1
#define IMXRT117X_PAD_AD_15_LPUART10_TXD		0x0148 0x038C 0x0628 0x1 0x0
#define IMXRT117X_PAD_AD_15_GPT1_COMPARE2		0x0148 0x038C 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_15_FLEXSPI1_B_DATA00		0x0148 0x038C 0x0564 0x3 0x0
#define IMXRT117X_PAD_AD_15_VIDEO_MUX_CSI_HSYNC		0x0148 0x038C 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_15_GPIO_MUX3_IO14		0x0148 0x038C 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_15_ENET_TX_ER			0x0148 0x038C 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_15_FLEXIO2_D15			0x0148 0x038C 0x0000 0x8 0x0

#define IMXRT117X_PAD_AD_16_SPDIF_OUT			0x014C 0x0390 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_16_LPUART10_RXD		0x014C 0x0390 0x0624 0x1 0x0
#define IMXRT117X_PAD_AD_16_GPT1_COMPARE3		0x014C 0x0390 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_16_FLEXSPI1_B_SCLK		0x014C 0x0390 0x0578 0x3 0x0
#define IMXRT117X_PAD_AD_16_VIDEO_MUX_CSI_DATA09	0x014C 0x0390 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_16_GPIO_MUX3_IO15		0x014C 0x0390 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_16_ENET_RX_DATA03		0x014C 0x0390 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_16_FLEXIO2_D16			0x014C 0x0390 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_16_ENET_1G_MDC			0x014C 0x0390 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_16_GPIO9_IO15			0x014C 0x0390 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_16_FLEXPWM3_PWM2_X		0x014C 0x0390 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_17_SAI1_MCLK			0x0150 0x0394 0x066C 0x0 0x0
#define IMXRT117X_PAD_AD_17_ACMP1_OUT			0x0150 0x0394 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_17_GPT1_CLK			0x0150 0x0394 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_17_FLEXSPI1_A_DQS		0x0150 0x0394 0x0550 0x3 0x1
#define IMXRT117X_PAD_AD_17_VIDEO_MUX_CSI_DATA08	0x0150 0x0394 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_17_GPIO_MUX3_IO16		0x0150 0x0394 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_17_ENET_RX_DATA02		0x0150 0x0394 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_17_FLEXIO2_D17			0x0150 0x0394 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_17_ENET_1G_MDIO		0x0150 0x0394 0x04C8 0x9 0x2
#define IMXRT117X_PAD_AD_17_GPIO9_IO16			0x0150 0x0394 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_17_FLEXPWM3_PWM3_X		0x0150 0x0394 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_18_GPIO9_IO17			0x0154 0x0398 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_18_FLEXPWM4_PWM0_X		0x0154 0x0398 0x0000 0xB 0x0
#define IMXRT117X_PAD_AD_18_SAI1_RX_SYNC		0x0154 0x0398 0x0678 0x0 0x0
#define IMXRT117X_PAD_AD_18_ACMP2_OUT			0x0154 0x0398 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_18_LPSPI1_PCS1			0x0154 0x0398 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_18_FLEXSPI1_A_SS0_B		0x0154 0x0398 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_18_VIDEO_MUX_CSI_DATA07	0x0154 0x0398 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_18_GPIO_MUX3_IO17		0x0154 0x0398 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_18_ENET_CRS			0x0154 0x0398 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_18_FLEXIO2_D18			0x0154 0x0398 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_18_LPI2C2_SCL			0x0154 0x0398 0x05B4 0x9 0x1

#define IMXRT117X_PAD_AD_19_SAI1_RX_BCLK		0x0158 0x039C 0x0670 0x0 0x0
#define IMXRT117X_PAD_AD_19_ACMP3_OUT			0x0158 0x039C 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_19_LPSPI1_PCS2			0x0158 0x039C 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_19_FLEXSPI1_A_SCLK		0x0158 0x039C 0x0574 0x3 0x0
#define IMXRT117X_PAD_AD_19_VIDEO_MUX_CSI_DATA06	0x0158 0x039C 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_19_GPIO_MUX3_IO18		0x0158 0x039C 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_19_ENET_COL			0x0158 0x039C 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_19_FLEXIO2_D19			0x0158 0x039C 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_19_LPI2C2_SDA			0x0158 0x039C 0x05B8 0x9 0x1
#define IMXRT117X_PAD_AD_19_GPIO9_IO18			0x0158 0x039C 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_19_FLEXPWM4_PWM1_X		0x0158 0x039C 0x0000 0xB 0x0

