EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_AD_20_SAI1_RX_DATA00		0x015C 0x03A0 0x0674 0x0 0x0
#define IMXRT117X_PAD_AD_20_ACMP4_OUT			0x015C 0x03A0 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_20_LPSPI1_PCS3			0x015C 0x03A0 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_20_FLEXSPI1_A_DATA00		0x015C 0x03A0 0x0554 0x3 0x0
#define IMXRT117X_PAD_AD_20_VIDEO_MUX_CSI_DATA05	0x015C 0x03A0 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_20_GPIO_MUX3_IO19		0x015C 0x03A0 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_20_KPP_ROW07			0x015C 0x03A0 0x05A8 0x6 0x0
#define IMXRT117X_PAD_AD_20_FLEXIO2_D20			0x015C 0x03A0 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_20_ENET_QOS_1588_EVENT2_OUT	0x015C 0x03A0 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_20_GPIO9_IO19			0x015C 0x03A0 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_20_FLEXPWM4_PWM2_X		0x015C 0x03A0 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_21_SAI1_TX_DATA00		0x0160 0x03A4 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_21_LPSPI2_PCS1			0x0160 0x03A4 0x05E0 0x2 0x0
#define IMXRT117X_PAD_AD_21_FLEXSPI1_A_DATA01		0x0160 0x03A4 0x0558 0x3 0x0
#define IMXRT117X_PAD_AD_21_VIDEO_MUX_CSI_DATA04	0x0160 0x03A4 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_21_GPIO_MUX3_IO20		0x0160 0x03A4 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_21_KPP_COL07			0x0160 0x03A4 0x05A0 0x6 0x0
#define IMXRT117X_PAD_AD_21_FLEXIO2_D21			0x0160 0x03A4 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_21_ENET_QOS_1588_EVENT2_IN	0x0160 0x03A4 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_21_GPIO9_IO20			0x0160 0x03A4 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_21_FLEXPWM4_PWM3_X		0x0160 0x03A4 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_22_GPIO9_IO21			0x0164 0x03A8 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_22_SAI1_TX_BCLK		0x0164 0x03A8 0x067C 0x0 0x0
#define IMXRT117X_PAD_AD_22_LPSPI2_PCS2			0x0164 0x03A8 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_22_FLEXSPI1_A_DATA02		0x0164 0x03A8 0x055C 0x3 0x0
#define IMXRT117X_PAD_AD_22_VIDEO_MUX_CSI_DATA03	0x0164 0x03A8 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_22_GPIO_MUX3_IO21		0x0164 0x03A8 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_22_KPP_ROW06			0x0164 0x03A8 0x05A4 0x6 0x0
#define IMXRT117X_PAD_AD_22_FLEXIO2_D22			0x0164 0x03A8 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_22_ENET_QOS_1588_EVENT3_OUT	0x0164 0x03A8 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_23_SAI1_TX_SYNC		0x0168 0x03AC 0x0680 0x0 0x0
#define IMXRT117X_PAD_AD_23_LPSPI2_PCS3			0x0168 0x03AC 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_23_FLEXSPI1_A_DATA03		0x0168 0x03AC 0x0560 0x3 0x0
#define IMXRT117X_PAD_AD_23_VIDEO_MUX_CSI_DATA02	0x0168 0x03AC 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_23_GPIO_MUX3_IO22		0x0168 0x03AC 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_23_KPP_COL06			0x0168 0x03AC 0x059C 0x6 0x0
#define IMXRT117X_PAD_AD_23_FLEXIO2_D23			0x0168 0x03AC 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_23_ENET_QOS_1588_EVENT3_IN	0x0168 0x03AC 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_23_GPIO9_IO22			0x0168 0x03AC 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_24_LPUART1_TXD			0x016C 0x03B0 0x0620 0x0 0x0
#define IMXRT117X_PAD_AD_24_LPSPI2_SCK			0x016C 0x03B0 0x05E4 0x1 0x0
#define IMXRT117X_PAD_AD_24_VIDEO_MUX_CSI_DATA00	0x016C 0x03B0 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_24_ENET_RX_EN			0x016C 0x03B0 0x04B8 0x3 0x0
#define IMXRT117X_PAD_AD_24_FLEXPWM2_PWM0_A		0x016C 0x03B0 0x0518 0x4 0x1
#define IMXRT117X_PAD_AD_24_GPIO_MUX3_IO23		0x016C 0x03B0 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_24_KPP_ROW05			0x016C 0x03B0 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_24_FLEXIO2_D24			0x016C 0x03B0 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_24_LPI2C4_SCL			0x016C 0x03B0 0x05C4 0x9 0x0
#define IMXRT117X_PAD_AD_24_GPIO9_IO23			0x016C 0x03B0 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_25_LPUART1_RXD			0x0170 0x03B4 0x061C 0x0 0x0
#define IMXRT117X_PAD_AD_25_LPSPI2_PCS0			0x0170 0x03B4 0x05DC 0x1 0x0
#define IMXRT117X_PAD_AD_25_VIDEO_MUX_CSI_DATA01	0x0170 0x03B4 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_25_ENET_RX_ER			0x0170 0x03B4 0x04BC 0x3 0x0
#define IMXRT117X_PAD_AD_25_FLEXPWM2_PWM0_B		0x0170 0x03B4 0x0524 0x4 0x1
#define IMXRT117X_PAD_AD_25_GPIO_MUX3_IO24		0x0170 0x03B4 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_25_KPP_COL05			0x0170 0x03B4 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_25_FLEXIO2_D25			0x0170 0x03B4 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_25_LPI2C4_SDA			0x0170 0x03B4 0x05C8 0x9 0x0
#define IMXRT117X_PAD_AD_25_GPIO9_IO24			0x0170 0x03B4 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_26_LPUART1_CTS_B		0x0174 0x03B8 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_26_LPSPI2_SOUT			0x0174 0x03B8 0x05EC 0x1 0x0
#define IMXRT117X_PAD_AD_26_SEMC_CSX01			0x0174 0x03B8 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_26_ENET_RX_DATA00		0x0174 0x03B8 0x04B0 0x3 0x0
#define IMXRT117X_PAD_AD_26_FLEXPWM2_PWM1_A		0x0174 0x03B8 0x051C 0x4 0x1
#define IMXRT117X_PAD_AD_26_GPIO_MUX3_IO25		0x0174 0x03B8 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_26_KPP_ROW04			0x0174 0x03B8 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_26_FLEXIO2_D26			0x0174 0x03B8 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_26_ENET_QOS_MDC		0x0174 0x03B8 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_26_GPIO9_IO25			0x0174 0x03B8 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_26_USDHC2_CD_B			0x0174 0x03B8 0x06D0 0xB 0x1

#define IMXRT117X_PAD_AD_27_LPUART1_RTS_B		0x0178 0x03BC 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_27_LPSPI2_SIN			0x0178 0x03BC 0x05E8 0x1 0x0
#define IMXRT117X_PAD_AD_27_SEMC_CSX02			0x0178 0x03BC 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_27_ENET_RX_DATA01		0x0178 0x03BC 0x04B4 0x3 0x0
#define IMXRT117X_PAD_AD_27_FLEXPWM2_PWM1_B		0x0178 0x03BC 0x0528 0x4 0x1
#define IMXRT117X_PAD_AD_27_GPIO_MUX3_IO26		0x0178 0x03BC 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_27_KPP_COL04			0x0178 0x03BC 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_27_FLEXIO2_D27			0x0178 0x03BC 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_27_ENET_QOS_MDIO		0x0178 0x03BC 0x04EC 0x9 0x1
#define IMXRT117X_PAD_AD_27_GPIO9_IO26			0x0178 0x03BC 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_27_USDHC2_WP			0x0178 0x03BC 0x06D4 0xB 0x1

#define IMXRT117X_PAD_AD_28_GPIO9_IO27			0x017C 0x03C0 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_28_USDHC2_VSELECT		0x017C 0x03C0 0x0000 0xB 0x0
#define IMXRT117X_PAD_AD_28_LPSPI1_SCK			0x017C 0x03C0 0x05D0 0x0 0x1
#define IMXRT117X_PAD_AD_28_LPUART5_TXD			0x017C 0x03C0 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_28_SEMC_CSX03			0x017C 0x03C0 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_28_ENET_TX_EN			0x017C 0x03C0 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_28_FLEXPWM2_PWM2_A		0x017C 0x03C0 0x0520 0x4 0x1
#define IMXRT117X_PAD_AD_28_GPIO_MUX3_IO27		0x017C 0x03C0 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_28_KPP_ROW03			0x017C 0x03C0 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_28_FLEXIO2_D28			0x017C 0x03C0 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_28_VIDEO_MUX_EXT_DCIC1		0x017C 0x03C0 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_29_LPSPI1_PCS0			0x0180 0x03C4 0x05CC 0x0 0x1
#define IMXRT117X_PAD_AD_29_LPUART5_RXD			0x0180 0x03C4 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_29_ENET_REF_CLK		0x0180 0x03C4 0x04A8 0x2 0x0
#define IMXRT117X_PAD_AD_29_ENET_TX_CLK			0x0180 0x03C4 0x04C0 0x3 0x0
#define IMXRT117X_PAD_AD_29_FLEXPWM2_PWM2_B		0x0180 0x03C4 0x052C 0x4 0x1
#define IMXRT117X_PAD_AD_29_GPIO_MUX3_IO28		0x0180 0x03C4 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_29_KPP_COL03			0x0180 0x03C4 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_29_FLEXIO2_D29			0x0180 0x03C4 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_29_VIDEO_MUX_EXT_DCIC2		0x0180 0x03C4 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_29_GPIO9_IO28			0x0180 0x03C4 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_29_USDHC2_RESET_B		0x0180 0x03C4 0x0000 0xB 0x0

#define IMXRT117X_PAD_AD_30_LPSPI1_SOUT			0x0184 0x03C8 0x05D8 0x0 0x1
#define IMXRT117X_PAD_AD_30_USB_OTG2_OC			0x0184 0x03C8 0x06B8 0x1 0x1
#define IMXRT117X_PAD_AD_30_FLEXCAN2_TX			0x0184 0x03C8 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_30_ENET_TX_DATA00		0x0184 0x03C8 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_30_LPUART3_TXD			0x0184 0x03C8 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_30_GPIO_MUX3_IO29		0x0184 0x03C8 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_30_KPP_ROW02			0x0184 0x03C8 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_30_FLEXIO2_D30			0x0184 0x03C8 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_30_WDOG2_RESET_B_DEB		0x0184 0x03C8 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_30_GPIO9_IO29			0x0184 0x03C8 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_31_LPSPI1_SIN			0x0188 0x03CC 0x05D4 0x0 0x1
#define IMXRT117X_PAD_AD_31_USB_OTG2_PWR		0x0188 0x03CC 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_31_FLEXCAN2_RX			0x0188 0x03CC 0x049C 0x2 0x1
#define IMXRT117X_PAD_AD_31_ENET_TX_DATA01		0x0188 0x03CC 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_31_LPUART3_RXD			0x0188 0x03CC 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_31_GPIO_MUX3_IO30		0x0188 0x03CC 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_31_KPP_COL02			0x0188 0x03CC 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_31_FLEXIO2_D31			0x0188 0x03CC 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_31_WDOG1_RESET_B_DEB		0x0188 0x03CC 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_31_GPIO9_IO30			0x0188 0x03CC 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_32_GPIO9_IO31			0x018C 0x03D0 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_32_LPI2C1_SCL			0x018C 0x03D0 0x05AC 0x0 0x1
#define IMXRT117X_PAD_AD_32_USBPHY2_OTG_ID		0x018C 0x03D0 0x06C4 0x1 0x1
#define IMXRT117X_PAD_AD_32_PGMC_PMIC_RDY		0x018C 0x03D0 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_32_ENET_MDC			0x018C 0x03D0 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_32_USDHC1_CD_B			0x018C 0x03D0 0x06C8 0x4 0x0
#define IMXRT117X_PAD_AD_32_GPIO_MUX3_IO31		0x018C 0x03D0 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_32_KPP_ROW01			0x018C 0x03D0 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_32_LPUART10_TXD		0x018C 0x03D0 0x0628 0x8 0x1
#define IMXRT117X_PAD_AD_32_ENET_1G_MDC			0x018C 0x03D0 0x0000 0x9 0x0

#define IMXRT117X_PAD_AD_33_LPI2C1_SDA			0x0190 0x03D4 0x05B0 0x0 0x1
#define IMXRT117X_PAD_AD_33_USBPHY1_OTG_ID		0x0190 0x03D4 0x06C0 0x1 0x1
#define IMXRT117X_PAD_AD_33_XBAR1_INOUT17		0x0190 0x03D4 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_33_ENET_MDIO			0x0190 0x03D4 0x04AC 0x3 0x1
#define IMXRT117X_PAD_AD_33_USDHC1_WP			0x0190 0x03D4 0x06CC 0x4 0x0
#define IMXRT117X_PAD_AD_33_GPIO_MUX4_IO00		0x0190 0x03D4 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_33_KPP_COL01			0x0190 0x03D4 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_33_LPUART10_RXD		0x0190 0x03D4 0x0624 0x8 0x1
#define IMXRT117X_PAD_AD_33_ENET_1G_MDIO		0x0190 0x03D4 0x04C8 0x9 0x3
#define IMXRT117X_PAD_AD_33_GPIO10_IO00			0x0190 0x03D4 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_34_ENET_1G_1588_EVENT0_IN	0x0194 0x03D8 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_34_USB_OTG1_PWR		0x0194 0x03D8 0x0000 0x1 0x0
#define IMXRT117X_PAD_AD_34_XBAR1_INOUT18		0x0194 0x03D8 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_34_ENET_1588_EVENT0_IN		0x0194 0x03D8 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_34_USDHC1_VSELECT		0x0194 0x03D8 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_34_GPIO_MUX4_IO01		0x0194 0x03D8 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_34_KPP_ROW00			0x0194 0x03D8 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_34_LPUART10_CTS_B		0x0194 0x03D8 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_34_WDOG1_ANY			0x0194 0x03D8 0x0000 0x9 0x0
#define IMXRT117X_PAD_AD_34_GPIO10_IO01			0x0194 0x03D8 0x0000 0xA 0x0

#define IMXRT117X_PAD_AD_35_GPIO10_IO02			0x0198 0x03DC 0x0000 0xA 0x0
#define IMXRT117X_PAD_AD_35_ENET_1G_1588_EVENT0_OUT	0x0198 0x03DC 0x0000 0x0 0x0
#define IMXRT117X_PAD_AD_35_USB_OTG1_OC			0x0198 0x03DC 0x06BC 0x1 0x1
#define IMXRT117X_PAD_AD_35_XBAR1_INOUT19		0x0198 0x03DC 0x0000 0x2 0x0
#define IMXRT117X_PAD_AD_35_ENET_1588_EVENT0_OUT	0x0198 0x03DC 0x0000 0x3 0x0
#define IMXRT117X_PAD_AD_35_USDHC1_RESET_B		0x0198 0x03DC 0x0000 0x4 0x0
#define IMXRT117X_PAD_AD_35_GPIO_MUX4_IO02		0x0198 0x03DC 0x0000 0x5 0x0
#define IMXRT117X_PAD_AD_35_KPP_COL00			0x0198 0x03DC 0x0000 0x6 0x0
#define IMXRT117X_PAD_AD_35_LPUART10_RTS_B		0x0198 0x03DC 0x0000 0x8 0x0
#define IMXRT117X_PAD_AD_35_FLEXSPI1_B_SS1_B		0x0198 0x03DC 0x0000 0x9 0x0

#define IMXRT117X_PAD_SD_B1_00_USDHC1_CMD		0x019C 0x03E0 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_00_XBAR1_INOUT20		0x019C 0x03E0 0x06D8 0x2 0x1
#define IMXRT117X_PAD_SD_B1_00_GPT4_CAPTURE1		0x019C 0x03E0 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_00_GPIO_MUX4_IO03		0x019C 0x03E0 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_00_FLEXSPI2_A_SS0_B		0x019C 0x03E0 0x0000 0x6 0x0
#define IMXRT117X_PAD_SD_B1_00_KPP_ROW07		0x019C 0x03E0 0x05A8 0x8 0x1
#define IMXRT117X_PAD_SD_B1_00_GPIO10_IO03		0x019C 0x03E0 0x0000 0xA 0x0

