EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_SD_B1_01_USDHC1_CLK		0x01A0 0x03E4 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_01_XBAR1_INOUT21		0x01A0 0x03E4 0x06DC 0x2 0x1
#define IMXRT117X_PAD_SD_B1_01_GPT4_CAPTURE2		0x01A0 0x03E4 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_01_GPIO_MUX4_IO04		0x01A0 0x03E4 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_01_FLEXSPI2_A_SCLK		0x01A0 0x03E4 0x058C 0x6 0x1
#define IMXRT117X_PAD_SD_B1_01_KPP_COL07		0x01A0 0x03E4 0x05A0 0x8 0x1
#define IMXRT117X_PAD_SD_B1_01_GPIO10_IO04		0x01A0 0x03E4 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B1_02_GPIO10_IO05		0x01A4 0x03E8 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B1_02_USDHC1_DATA0		0x01A4 0x03E8 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_02_XBAR1_INOUT22		0x01A4 0x03E8 0x06E0 0x2 0x1
#define IMXRT117X_PAD_SD_B1_02_GPT4_COMPARE1		0x01A4 0x03E8 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_02_GPIO_MUX4_IO05		0x01A4 0x03E8 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_02_FLEXSPI2_A_DATA00	0x01A4 0x03E8 0x057C 0x6 0x1
#define IMXRT117X_PAD_SD_B1_02_KPP_ROW06		0x01A4 0x03E8 0x05A4 0x8 0x1
#define IMXRT117X_PAD_SD_B1_02_FLEXSPI1_A_SS1_B		0x01A4 0x03E8 0x0000 0x9 0x0

#define IMXRT117X_PAD_SD_B1_03_USDHC1_DATA1		0x01A8 0x03EC 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_03_XBAR1_INOUT23		0x01A8 0x03EC 0x06E4 0x2 0x1
#define IMXRT117X_PAD_SD_B1_03_GPT4_COMPARE2		0x01A8 0x03EC 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_03_GPIO_MUX4_IO06		0x01A8 0x03EC 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_03_FLEXSPI2_A_DATA01	0x01A8 0x03EC 0x0580 0x6 0x1
#define IMXRT117X_PAD_SD_B1_03_KPP_COL06		0x01A8 0x03EC 0x059C 0x8 0x1
#define IMXRT117X_PAD_SD_B1_03_FLEXSPI1_B_SS1_B		0x01A8 0x03EC 0x0000 0x9 0x0
#define IMXRT117X_PAD_SD_B1_03_GPIO10_IO06		0x01A8 0x03EC 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B1_04_USDHC1_DATA2		0x01AC 0x03F0 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_04_XBAR1_INOUT24		0x01AC 0x03F0 0x06E8 0x2 0x1
#define IMXRT117X_PAD_SD_B1_04_GPT4_COMPARE3		0x01AC 0x03F0 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_04_GPIO_MUX4_IO07		0x01AC 0x03F0 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_04_FLEXSPI2_A_DATA02	0x01AC 0x03F0 0x0584 0x6 0x1
#define IMXRT117X_PAD_SD_B1_04_FLEXSPI1_B_SS0_B		0x01AC 0x03F0 0x0000 0x8 0x0
#define IMXRT117X_PAD_SD_B1_04_ENET_QOS_1588_EVENT2_AUX_IN	0x01AC 0x03F0 0x0000 0x9 0x0
#define IMXRT117X_PAD_SD_B1_04_GPIO10_IO07		0x01AC 0x03F0 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B1_05_GPIO10_IO08		0x01B0 0x03F4 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B1_05_USDHC1_DATA3		0x01B0 0x03F4 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B1_05_XBAR1_INOUT25		0x01B0 0x03F4 0x06EC 0x2 0x1
#define IMXRT117X_PAD_SD_B1_05_GPT4_CLK			0x01B0 0x03F4 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B1_05_GPIO_MUX4_IO08		0x01B0 0x03F4 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B1_05_FLEXSPI2_A_DATA03	0x01B0 0x03F4 0x0588 0x6 0x1
#define IMXRT117X_PAD_SD_B1_05_FLEXSPI1_B_DQS		0x01B0 0x03F4 0x0000 0x8 0x0
#define IMXRT117X_PAD_SD_B1_05_ENET_QOS_1588_EVENT3_AUX_IN	0x01B0 0x03F4 0x0000 0x9 0x0

#define IMXRT117X_PAD_SD_B2_00_GPIO10_IO09		0x01B4 0x03F8 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_00_USDHC2_DATA3		0x01B4 0x03F8 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_00_FLEXSPI1_B_DATA03	0x01B4 0x03F8 0x0570 0x1 0x1
#define IMXRT117X_PAD_SD_B2_00_ENET_1G_RX_EN		0x01B4 0x03F8 0x04E0 0x2 0x1
#define IMXRT117X_PAD_SD_B2_00_LPUART9_TXD		0x01B4 0x03F8 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_00_LPSPI4_SCK		0x01B4 0x03F8 0x0610 0x4 0x0
#define IMXRT117X_PAD_SD_B2_00_GPIO_MUX4_IO09		0x01B4 0x03F8 0x0000 0x5 0x0

#define IMXRT117X_PAD_SD_B2_01_USDHC2_DATA2		0x01B8 0x03FC 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_01_FLEXSPI1_B_DATA02	0x01B8 0x03FC 0x056C 0x1 0x1
#define IMXRT117X_PAD_SD_B2_01_ENET_1G_RX_CLK		0x01B8 0x03FC 0x04CC 0x2 0x1
#define IMXRT117X_PAD_SD_B2_01_LPUART9_RXD		0x01B8 0x03FC 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_01_LPSPI4_PCS0		0x01B8 0x03FC 0x060C 0x4 0x0
#define IMXRT117X_PAD_SD_B2_01_GPIO_MUX4_IO10		0x01B8 0x03FC 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_01_GPIO10_IO10		0x01B8 0x03FC 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B2_02_GPIO10_IO11		0x01BC 0x0400 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_02_USDHC2_DATA1		0x01BC 0x0400 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_02_FLEXSPI1_B_DATA01	0x01BC 0x0400 0x0568 0x1 0x1
#define IMXRT117X_PAD_SD_B2_02_ENET_1G_RX_DATA00	0x01BC 0x0400 0x04D0 0x2 0x1
#define IMXRT117X_PAD_SD_B2_02_LPUART9_CTS_B		0x01BC 0x0400 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_02_LPSPI4_SOUT		0x01BC 0x0400 0x0618 0x4 0x0
#define IMXRT117X_PAD_SD_B2_02_GPIO_MUX4_IO11		0x01BC 0x0400 0x0000 0x5 0x0

#define IMXRT117X_PAD_SD_B2_03_GPIO10_IO12		0x01C0 0x0404 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_03_USDHC2_DATA0		0x01C0 0x0404 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_03_FLEXSPI1_B_DATA00	0x01C0 0x0404 0x0564 0x1 0x1
#define IMXRT117X_PAD_SD_B2_03_ENET_1G_RX_DATA01	0x01C0 0x0404 0x04D4 0x2 0x1
#define IMXRT117X_PAD_SD_B2_03_LPUART9_RTS_B		0x01C0 0x0404 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_03_LPSPI4_SIN		0x01C0 0x0404 0x0614 0x4 0x0
#define IMXRT117X_PAD_SD_B2_03_GPIO_MUX4_IO12		0x01C0 0x0404 0x0000 0x5 0x0

#define IMXRT117X_PAD_SD_B2_04_USDHC2_CLK		0x01C4 0x0408 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_04_FLEXSPI1_B_SCLK		0x01C4 0x0408 0x0578 0x1 0x1
#define IMXRT117X_PAD_SD_B2_04_ENET_1G_RX_DATA02	0x01C4 0x0408 0x04D8 0x2 0x1
#define IMXRT117X_PAD_SD_B2_04_FLEXSPI1_A_SS1_B		0x01C4 0x0408 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_04_LPSPI4_PCS1		0x01C4 0x0408 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_04_GPIO_MUX4_IO13		0x01C4 0x0408 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_04_GPIO10_IO13		0x01C4 0x0408 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B2_05_GPIO10_IO14		0x01C8 0x040C 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_05_USDHC2_CMD		0x01C8 0x040C 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_05_FLEXSPI1_A_DQS		0x01C8 0x040C 0x0550 0x1 0x2
#define IMXRT117X_PAD_SD_B2_05_ENET_1G_RX_DATA03	0x01C8 0x040C 0x04DC 0x2 0x1
#define IMXRT117X_PAD_SD_B2_05_FLEXSPI1_B_SS0_B		0x01C8 0x040C 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_05_LPSPI4_PCS2		0x01C8 0x040C 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_05_GPIO_MUX4_IO14		0x01C8 0x040C 0x0000 0x5 0x0

#define IMXRT117X_PAD_SD_B2_06_GPIO10_IO15		0x01CC 0x0410 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_06_USDHC2_RESET_B		0x01CC 0x0410 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_06_FLEXSPI1_A_SS0_B		0x01CC 0x0410 0x0000 0x1 0x0
#define IMXRT117X_PAD_SD_B2_06_ENET_1G_TX_DATA03	0x01CC 0x0410 0x0000 0x2 0x0
#define IMXRT117X_PAD_SD_B2_06_LPSPI4_PCS3		0x01CC 0x0410 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_06_GPT6_CAPTURE1		0x01CC 0x0410 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_06_GPIO_MUX4_IO15		0x01CC 0x0410 0x0000 0x5 0x0

#define IMXRT117X_PAD_SD_B2_07_USDHC2_STROBE		0x01D0 0x0414 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_07_FLEXSPI1_A_SCLK		0x01D0 0x0414 0x0574 0x1 0x1
#define IMXRT117X_PAD_SD_B2_07_ENET_1G_TX_DATA02	0x01D0 0x0414 0x0000 0x2 0x0
#define IMXRT117X_PAD_SD_B2_07_LPUART3_CTS_B		0x01D0 0x0414 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_07_GPT6_CAPTURE2		0x01D0 0x0414 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_07_GPIO_MUX4_IO16		0x01D0 0x0414 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_07_LPSPI2_SCK		0x01D0 0x0414 0x05E4 0x6 0x1
#define IMXRT117X_PAD_SD_B2_07_ENET_TX_ER		0x01D0 0x0414 0x0000 0x8 0x0
#define IMXRT117X_PAD_SD_B2_07_ENET_QOS_REF_CLK		0x01D0 0x0414 0x04A0 0x9 0x1
#define IMXRT117X_PAD_SD_B2_07_GPIO10_IO16		0x01D0 0x0414 0x0000 0xA 0x0

#define IMXRT117X_PAD_SD_B2_08_GPIO10_IO17		0x01D4 0x0418 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_08_USDHC2_DATA4		0x01D4 0x0418 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_08_FLEXSPI1_A_DATA00	0x01D4 0x0418 0x0554 0x1 0x1
#define IMXRT117X_PAD_SD_B2_08_ENET_1G_TX_DATA01	0x01D4 0x0418 0x0000 0x2 0x0
#define IMXRT117X_PAD_SD_B2_08_LPUART3_RTS_B		0x01D4 0x0418 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_08_GPT6_COMPARE1		0x01D4 0x0418 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_08_GPIO_MUX4_IO17		0x01D4 0x0418 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_08_LPSPI2_PCS0		0x01D4 0x0418 0x05DC 0x6 0x1

#define IMXRT117X_PAD_SD_B2_09_GPIO10_IO18		0x01D8 0x041C 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_09_USDHC2_DATA5		0x01D8 0x041C 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_09_FLEXSPI1_A_DATA01	0x01D8 0x041C 0x0558 0x1 0x1
#define IMXRT117X_PAD_SD_B2_09_ENET_1G_TX_DATA00	0x01D8 0x041C 0x0000 0x2 0x0
#define IMXRT117X_PAD_SD_B2_09_LPUART5_CTS_B		0x01D8 0x041C 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_09_GPT6_COMPARE2		0x01D8 0x041C 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_09_GPIO_MUX4_IO18		0x01D8 0x041C 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_09_LPSPI2_SOUT		0x01D8 0x041C 0x05EC 0x6 0x1

#define IMXRT117X_PAD_SD_B2_10_GPIO10_IO19		0x01DC 0x0420 0x0000 0xA 0x0
#define IMXRT117X_PAD_SD_B2_10_USDHC2_DATA6		0x01DC 0x0420 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_10_FLEXSPI1_A_DATA02	0x01DC 0x0420 0x055C 0x1 0x1
#define IMXRT117X_PAD_SD_B2_10_ENET_1G_TX_EN		0x01DC 0x0420 0x0000 0x2 0x0
#define IMXRT117X_PAD_SD_B2_10_LPUART5_RTS_B		0x01DC 0x0420 0x0000 0x3 0x0
#define IMXRT117X_PAD_SD_B2_10_GPT6_COMPARE3		0x01DC 0x0420 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_10_GPIO_MUX4_IO19		0x01DC 0x0420 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_10_LPSPI2_SIN		0x01DC 0x0420 0x05E8 0x6 0x1

#define IMXRT117X_PAD_SD_B2_11_USDHC2_DATA7		0x01E0 0x0424 0x0000 0x0 0x0
#define IMXRT117X_PAD_SD_B2_11_FLEXSPI1_A_DATA03	0x01E0 0x0424 0x0560 0x1 0x1
#define IMXRT117X_PAD_SD_B2_11_ENET_1G_TX_CLK_IO	0x01E0 0x0424 0x04E8 0x2 0x1
#define IMXRT117X_PAD_SD_B2_11_ENET_1G_REF_CLK		0x01E0 0x0424 0x04C4 0x3 0x1
#define IMXRT117X_PAD_SD_B2_11_GPT6_CLK			0x01E0 0x0424 0x0000 0x4 0x0
#define IMXRT117X_PAD_SD_B2_11_GPIO_MUX4_IO20		0x01E0 0x0424 0x0000 0x5 0x0
#define IMXRT117X_PAD_SD_B2_11_LPSPI2_PCS1		0x01E0 0x0424 0x05E0 0x6 0x1
#define IMXRT117X_PAD_SD_B2_11_GPIO10_IO20		0x01E0 0x0424 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_00_VIDEO_MUX_LCDIF_CLK	0x01E4 0x0428 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_00_ENET_1G_RX_EN		0x01E4 0x0428 0x04E0 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_00_TMR1_TIMER0		0x01E4 0x0428 0x063C 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_00_XBAR1_INOUT26		0x01E4 0x0428 0x06F0 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_00_GPIO_MUX4_IO21		0x01E4 0x0428 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_00_ENET_QOS_RX_EN		0x01E4 0x0428 0x04F8 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_00_GPIO10_IO21		0x01E4 0x0428 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE	0x01E8 0x042C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_01_ENET_1G_RX_CLK		0x01E8 0x042C 0x04CC 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_01_ENET_1G_RX_ER		0x01E8 0x042C 0x04E4 0x2 0x1
#define IMXRT117X_PAD_DISP_B1_01_TMR1_TIMER1		0x01E8 0x042C 0x0640 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_01_XBAR1_INOUT27		0x01E8 0x042C 0x06F4 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_01_GPIO_MUX4_IO22		0x01E8 0x042C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_01_ENET_QOS_RX_CLK	0x01E8 0x042C 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_01_ENET_QOS_RX_ER		0x01E8 0x042C 0x04FC 0x9 0x0
#define IMXRT117X_PAD_DISP_B1_01_GPIO10_IO22		0x01E8 0x042C 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_02_GPIO10_IO23		0x01EC 0x0430 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC	0x01EC 0x0430 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_02_ENET_1G_RX_DATA00	0x01EC 0x0430 0x04D0 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_02_LPI2C3_SCL		0x01EC 0x0430 0x05BC 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_02_TMR1_TIMER2		0x01EC 0x0430 0x0644 0x3 0x1
#define IMXRT117X_PAD_DISP_B1_02_XBAR1_INOUT28		0x01EC 0x0430 0x06F8 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_02_GPIO_MUX4_IO23		0x01EC 0x0430 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_02_ENET_QOS_RX_DATA00	0x01EC 0x0430 0x04F0 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_02_LPUART1_TXD		0x01EC 0x0430 0x0620 0x9 0x1

#define IMXRT117X_PAD_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC	0x01F0 0x0434 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_03_ENET_1G_RX_DATA01	0x01F0 0x0434 0x04D4 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_03_LPI2C3_SDA		0x01F0 0x0434 0x05C0 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_03_TMR2_TIMER0		0x01F0 0x0434 0x0648 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_03_XBAR1_INOUT29		0x01F0 0x0434 0x06FC 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_03_GPIO_MUX4_IO24		0x01F0 0x0434 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_03_ENET_QOS_RX_DATA01	0x01F0 0x0434 0x04F4 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_03_LPUART1_RXD		0x01F0 0x0434 0x061C 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_03_GPIO10_IO24		0x01F0 0x0434 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00	0x01F4 0x0438 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_04_ENET_1G_RX_DATA02	0x01F4 0x0438 0x04D8 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_04_LPUART4_RXD		0x01F4 0x0438 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_04_TMR2_TIMER1		0x01F4 0x0438 0x064C 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_04_XBAR1_INOUT30		0x01F4 0x0438 0x0700 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_04_GPIO_MUX4_IO25		0x01F4 0x0438 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_04_ENET_QOS_RX_DATA02	0x01F4 0x0438 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_04_LPSPI3_SCK		0x01F4 0x0438 0x0600 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_04_GPIO10_IO25		0x01F4 0x0438 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_05_GPIO10_IO26		0x01F8 0x043C 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01	0x01F8 0x043C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_05_ENET_1G_RX_DATA03	0x01F8 0x043C 0x04DC 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_05_LPUART4_CTS_B		0x01F8 0x043C 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_05_TMR2_TIMER2		0x01F8 0x043C 0x0650 0x3 0x1
#define IMXRT117X_PAD_DISP_B1_05_XBAR1_INOUT31		0x01F8 0x043C 0x0704 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_05_GPIO_MUX4_IO26		0x01F8 0x043C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_05_ENET_QOS_RX_DATA03	0x01F8 0x043C 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_05_LPSPI3_SIN		0x01F8 0x043C 0x0604 0x9 0x1

#define IMXRT117X_PAD_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02	0x01FC 0x0440 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_06_ENET_1G_TX_DATA03	0x01FC 0x0440 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B1_06_LPUART4_TXD		0x01FC 0x0440 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_06_TMR3_TIMER0		0x01FC 0x0440 0x0654 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_06_XBAR1_INOUT32		0x01FC 0x0440 0x0708 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_06_GPIO_MUX4_IO27		0x01FC 0x0440 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_06_SRC_BT_CFG00		0x01FC 0x0440 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_06_ENET_QOS_TX_DATA03	0x01FC 0x0440 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_06_LPSPI3_SOUT		0x01FC 0x0440 0x0608 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_06_GPIO10_IO27		0x01FC 0x0440 0x0000 0xA 0x0

