EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03	0x0200 0x0444 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_07_ENET_1G_TX_DATA02	0x0200 0x0444 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B1_07_LPUART4_RTS_B		0x0200 0x0444 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_07_TMR3_TIMER1		0x0200 0x0444 0x0658 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_07_XBAR1_INOUT33		0x0200 0x0444 0x070C 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_07_GPIO_MUX4_IO28		0x0200 0x0444 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_07_SRC_BT_CFG01		0x0200 0x0444 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_07_ENET_QOS_TX_DATA02	0x0200 0x0444 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_07_LPSPI3_PCS0		0x0200 0x0444 0x05F0 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_07_GPIO10_IO28		0x0200 0x0444 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_08_GPIO10_IO29		0x0204 0x0448 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04	0x0204 0x0448 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_08_ENET_1G_TX_DATA01	0x0204 0x0448 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B1_08_USDHC1_CD_B		0x0204 0x0448 0x06C8 0x2 0x1
#define IMXRT117X_PAD_DISP_B1_08_TMR3_TIMER2		0x0204 0x0448 0x065C 0x3 0x1
#define IMXRT117X_PAD_DISP_B1_08_XBAR1_INOUT34		0x0204 0x0448 0x0710 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_08_GPIO_MUX4_IO29		0x0204 0x0448 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_08_SRC_BT_CFG02		0x0204 0x0448 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_08_ENET_QOS_TX_DATA01	0x0204 0x0448 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_08_LPSPI3_PCS1		0x0204 0x0448 0x05F4 0x9 0x1

#define IMXRT117X_PAD_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05	0x0208 0x044C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_09_ENET_1G_TX_DATA00	0x0208 0x044C 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B1_09_USDHC1_WP		0x0208 0x044C 0x06CC 0x2 0x1
#define IMXRT117X_PAD_DISP_B1_09_TMR4_TIMER0		0x0208 0x044C 0x0660 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_09_XBAR1_INOUT35		0x0208 0x044C 0x0714 0x4 0x1
#define IMXRT117X_PAD_DISP_B1_09_GPIO_MUX4_IO30		0x0208 0x044C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_09_SRC_BT_CFG03		0x0208 0x044C 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_09_ENET_QOS_TX_DATA00	0x0208 0x044C 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_09_LPSPI3_PCS2		0x0208 0x044C 0x05F8 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_09_GPIO10_IO30		0x0208 0x044C 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06	0x020C 0x0450 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_10_ENET_1G_TX_EN		0x020C 0x0450 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B1_10_USDHC1_RESET_B		0x020C 0x0450 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B1_10_TMR4_TIMER1		0x020C 0x0450 0x0664 0x3 0x2
#define IMXRT117X_PAD_DISP_B1_10_XBAR1_INOUT36		0x020C 0x0450 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B1_10_GPIO_MUX4_IO31		0x020C 0x0450 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_10_SRC_BT_CFG04		0x020C 0x0450 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_10_ENET_QOS_TX_EN		0x020C 0x0450 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_10_LPSPI3_PCS3		0x020C 0x0450 0x05FC 0x9 0x1
#define IMXRT117X_PAD_DISP_B1_10_GPIO10_IO31		0x020C 0x0450 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07	0x0210 0x0454 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B1_11_ENET_1G_TX_CLK_IO	0x0210 0x0454 0x04E8 0x1 0x2
#define IMXRT117X_PAD_DISP_B1_11_ENET_1G_REF_CLK	0x0210 0x0454 0x04C4 0x2 0x2
#define IMXRT117X_PAD_DISP_B1_11_TMR4_TIMER2		0x0210 0x0454 0x0668 0x3 0x1
#define IMXRT117X_PAD_DISP_B1_11_XBAR1_INOUT37		0x0210 0x0454 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B1_11_GPIO_MUX5_IO00		0x0210 0x0454 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B1_11_SRC_BT_CFG05		0x0210 0x0454 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B1_11_ENET_QOS_TX_CLK	0x0210 0x0454 0x04A4 0x8 0x0
#define IMXRT117X_PAD_DISP_B1_11_ENET_QOS_REF_CLK	0x0210 0x0454 0x04A0 0x9 0x2
#define IMXRT117X_PAD_DISP_B1_11_GPIO11_IO00		0x0210 0x0454 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B2_00_GPIO11_IO01		0x0214 0x0458 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08	0x0214 0x0458 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_00_WDOG1_B		0x0214 0x0458 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_00_MQS_RIGHT		0x0214 0x0458 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_00_ENET_1G_TX_ER		0x0214 0x0458 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_00_SAI1_TX_DATA03		0x0214 0x0458 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_00_GPIO_MUX5_IO01		0x0214 0x0458 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_00_SRC_BT_CFG06		0x0214 0x0458 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_00_ENET_QOS_TX_ER		0x0214 0x0458 0x0000 0x8 0x0

#define IMXRT117X_PAD_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09	0x0218 0x045C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_01_USDHC1_VSELECT		0x0218 0x045C 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_01_MQS_LEFT		0x0218 0x045C 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_01_WDOG2_B		0x0218 0x045C 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_01_SAI1_TX_DATA02		0x0218 0x045C 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_01_GPIO_MUX5_IO02		0x0218 0x045C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_01_SRC_BT_CFG07		0x0218 0x045C 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_01_EWM_OUT_B		0x0218 0x045C 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_01_CCM_ENET_REF_CLK_25M	0x0218 0x045C 0x0000 0x9 0x0
#define IMXRT117X_PAD_DISP_B2_01_GPIO11_IO02		0x0218 0x045C 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B2_02_GPIO11_IO03		0x021C 0x0460 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10	0x021C 0x0460 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_02_ENET_TX_DATA00		0x021C 0x0460 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_02_PIT1_TRIGGER3		0x021C 0x0460 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_02_ARM_TRACE00		0x021C 0x0460 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_02_SAI1_TX_DATA01		0x021C 0x0460 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_02_GPIO_MUX5_IO03		0x021C 0x0460 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_02_SRC_BT_CFG08		0x021C 0x0460 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_02_ENET_QOS_TX_DATA00	0x021C 0x0460 0x0000 0x8 0x0

#define IMXRT117X_PAD_DISP_B2_03_GPIO11_IO04		0x0220 0x0464 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11	0x0220 0x0464 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_03_ENET_TX_DATA01		0x0220 0x0464 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_03_PIT1_TRIGGER2		0x0220 0x0464 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_03_ARM_TRACE01		0x0220 0x0464 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_03_SAI1_MCLK		0x0220 0x0464 0x066C 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_03_GPIO_MUX5_IO04		0x0220 0x0464 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_03_SRC_BT_CFG09		0x0220 0x0464 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_03_ENET_QOS_TX_DATA01	0x0220 0x0464 0x0000 0x8 0x0

