EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12	0x0224 0x0468 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_04_ENET_TX_EN		0x0224 0x0468 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_04_PIT1_TRIGGER1		0x0224 0x0468 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_04_ARM_TRACE02		0x0224 0x0468 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_04_SAI1_RX_SYNC		0x0224 0x0468 0x0678 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_04_GPIO_MUX5_IO05		0x0224 0x0468 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_04_SRC_BT_CFG10		0x0224 0x0468 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_04_ENET_QOS_TX_EN		0x0224 0x0468 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_04_GPIO11_IO05		0x0224 0x0468 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B2_05_GPIO11_IO06		0x0228 0x046C 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13	0x0228 0x046C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_05_ENET_TX_CLK		0x0228 0x046C 0x04C0 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_05_ENET_REF_CLK		0x0228 0x046C 0x04A8 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_05_ARM_TRACE03		0x0228 0x046C 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_05_SAI1_RX_BCLK		0x0228 0x046C 0x0670 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_05_GPIO_MUX5_IO06		0x0228 0x046C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_05_SRC_BT_CFG11		0x0228 0x046C 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_05_ENET_QOS_TX_CLK	0x0228 0x046C 0x04A4 0x8 0x1

#define IMXRT117X_PAD_DISP_B2_06_GPIO11_IO07		0x022C 0x0470 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14	0x022C 0x0470 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_06_ENET_RX_DATA00		0x022C 0x0470 0x04B0 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_06_LPUART7_TXD		0x022C 0x0470 0x0630 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_06_ARM_TRACE_CLK		0x022C 0x0470 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_06_SAI1_RX_DATA00		0x022C 0x0470 0x0674 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_06_GPIO_MUX5_IO07		0x022C 0x0470 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_06_ENET_QOS_RX_DATA00	0x022C 0x0470 0x04F0 0x8 0x1

#define IMXRT117X_PAD_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15	0x0230 0x0474 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_07_ENET_RX_DATA01		0x0230 0x0474 0x04B4 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_07_LPUART7_RXD		0x0230 0x0474 0x062C 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_07_ARM_TRACE_SWO		0x0230 0x0474 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_07_SAI1_TX_DATA00		0x0230 0x0474 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_07_GPIO_MUX5_IO08		0x0230 0x0474 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_07_ENET_QOS_RX_DATA01	0x0230 0x0474 0x04F4 0x8 0x1
#define IMXRT117X_PAD_DISP_B2_07_GPIO11_IO08		0x0230 0x0474 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B2_08_GPIO11_IO09		0x0234 0x0478 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_08_VIDEO_MUX_LCDIF_DATA16	0x0234 0x0478 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_08_ENET_RX_EN		0x0234 0x0478 0x04B8 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_08_LPUART8_TXD		0x0234 0x0478 0x0638 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_08_ARM_CM7_EVENTO		0x0234 0x0478 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_08_SAI1_TX_BCLK		0x0234 0x0478 0x067C 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_08_GPIO_MUX5_IO09		0x0234 0x0478 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_08_ENET_QOS_RX_EN		0x0234 0x0478 0x04F8 0x8 0x1
#define IMXRT117X_PAD_DISP_B2_08_LPUART1_TXD		0x0234 0x0478 0x0620 0x9 0x2

#define IMXRT117X_PAD_DISP_B2_09_GPIO11_IO10		0x0238 0x047C 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_09_VIDEO_MUX_LCDIF_DATA17	0x0238 0x047C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_09_ENET_RX_ER		0x0238 0x047C 0x04BC 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_09_LPUART8_RXD		0x0238 0x047C 0x0634 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_09_ARM_CM7_EVENTI		0x0238 0x047C 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_09_SAI1_TX_SYNC		0x0238 0x047C 0x0680 0x4 0x1
#define IMXRT117X_PAD_DISP_B2_09_GPIO_MUX5_IO10		0x0238 0x047C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_09_ENET_QOS_RX_ER		0x0238 0x047C 0x04FC 0x8 0x1
#define IMXRT117X_PAD_DISP_B2_09_LPUART1_RXD		0x0238 0x047C 0x061C 0x9 0x2

#define IMXRT117X_PAD_DISP_B2_10_GPIO11_IO11		0x023C 0x0480 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_10_VIDEO_MUX_LCDIF_DATA18	0x023C 0x0480 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_10_EMVSIM2_IO		0x023C 0x0480 0x06A8 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_10_LPUART2_TXD		0x023C 0x0480 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_10_WDOG2_RESET_B_DEB	0x023C 0x0480 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_10_XBAR1_INOUT38		0x023C 0x0480 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_10_GPIO_MUX5_IO11		0x023C 0x0480 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_10_LPI2C3_SCL		0x023C 0x0480 0x05BC 0x6 0x1
#define IMXRT117X_PAD_DISP_B2_10_ENET_QOS_RX_ER		0x023C 0x0480 0x04FC 0x8 0x2
#define IMXRT117X_PAD_DISP_B2_10_SPDIF_IN		0x023C 0x0480 0x06B4 0x9 0x2

#define IMXRT117X_PAD_DISP_B2_11_VIDEO_MUX_LCDIF_DATA19	0x0240 0x0484 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_11_EMVSIM2_CLK		0x0240 0x0484 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_11_LPUART2_RXD		0x0240 0x0484 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_11_WDOG1_RESET_B_DEB	0x0240 0x0484 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_11_XBAR1_INOUT39		0x0240 0x0484 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_11_GPIO_MUX5_IO12		0x0240 0x0484 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_11_LPI2C3_SDA		0x0240 0x0484 0x05C0 0x6 0x1
#define IMXRT117X_PAD_DISP_B2_11_ENET_QOS_CRS		0x0240 0x0484 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_11_SPDIF_OUT		0x0240 0x0484 0x0000 0x9 0x0
#define IMXRT117X_PAD_DISP_B2_11_GPIO11_IO12		0x0240 0x0484 0x0000 0xA 0x0

#define IMXRT117X_PAD_DISP_B2_12_GPIO11_IO13		0x0244 0x0488 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_12_VIDEO_MUX_LCDIF_DATA20	0x0244 0x0488 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_12_EMVSIM2_RST		0x0244 0x0488 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_12_FLEXCAN1_TX		0x0244 0x0488 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_12_LPUART2_CTS_B		0x0244 0x0488 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_12_XBAR1_INOUT40		0x0244 0x0488 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_12_GPIO_MUX5_IO13		0x0244 0x0488 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_12_LPI2C4_SCL		0x0244 0x0488 0x05C4 0x6 0x1
#define IMXRT117X_PAD_DISP_B2_12_ENET_QOS_COL		0x0244 0x0488 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_12_LPSPI4_SCK		0x0244 0x0488 0x0610 0x9 0x1

#define IMXRT117X_PAD_DISP_B2_13_GPIO11_IO14		0x0248 0x048C 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_13_VIDEO_MUX_LCDIF_DATA21	0x0248 0x048C 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_13_EMVSIM2_SVEN		0x0248 0x048C 0x0000 0x1 0x0
#define IMXRT117X_PAD_DISP_B2_13_FLEXCAN1_RX		0x0248 0x048C 0x0498 0x2 0x1
#define IMXRT117X_PAD_DISP_B2_13_LPUART2_RTS_B		0x0248 0x048C 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_13_ENET_REF_CLK		0x0248 0x048C 0x04A8 0x4 0x2
#define IMXRT117X_PAD_DISP_B2_13_GPIO_MUX5_IO14		0x0248 0x048C 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_13_LPI2C4_SDA		0x0248 0x048C 0x05C8 0x6 0x1
#define IMXRT117X_PAD_DISP_B2_13_ENET_QOS_1588_EVENT0_OUT	0x0248 0x048C 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_13_LPSPI4_SIN		0x0248 0x048C 0x0614 0x9 0x1

