EmcraftSystems/linux-upstream/arch/arm/boot/dts/imxrt117x-pinfunc.h
#define IMXRT117X_PAD_DISP_B2_14_GPIO_MUX5_IO15		0x024C 0x0490 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_14_FLEXCAN1_TX		0x024C 0x0490 0x0000 0x6 0x0
#define IMXRT117X_PAD_DISP_B2_14_ENET_QOS_1588_EVENT0_IN	0x024C 0x0490 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_14_LPSPI4_SOUT		0x024C 0x0490 0x0618 0x9 0x1
#define IMXRT117X_PAD_DISP_B2_14_GPIO11_IO15		0x024C 0x0490 0x0000 0xA 0x0
#define IMXRT117X_PAD_DISP_B2_14_VIDEO_MUX_LCDIF_DATA22	0x024C 0x0490 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_14_EMVSIM2_PD		0x024C 0x0490 0x06AC 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_14_WDOG2_B		0x024C 0x0490 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_14_VIDEO_MUX_EXT_DCIC1	0x024C 0x0490 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_14_ENET_1G_REF_CLK	0x024C 0x0490 0x04C4 0x4 0x3

#define IMXRT117X_PAD_DISP_B2_15_VIDEO_MUX_LCDIF_DATA23	0x0250 0x0494 0x0000 0x0 0x0
#define IMXRT117X_PAD_DISP_B2_15_EMVSIM2_POWER_FAIL	0x0250 0x0494 0x06B0 0x1 0x1
#define IMXRT117X_PAD_DISP_B2_15_WDOG1_B		0x0250 0x0494 0x0000 0x2 0x0
#define IMXRT117X_PAD_DISP_B2_15_VIDEO_MUX_EXT_DCIC2	0x0250 0x0494 0x0000 0x3 0x0
#define IMXRT117X_PAD_DISP_B2_15_PIT1_TRIGGER0		0x0250 0x0494 0x0000 0x4 0x0
#define IMXRT117X_PAD_DISP_B2_15_GPIO_MUX5_IO16		0x0250 0x0494 0x0000 0x5 0x0
#define IMXRT117X_PAD_DISP_B2_15_FLEXCAN1_RX		0x0250 0x0494 0x0498 0x6 0x2
#define IMXRT117X_PAD_DISP_B2_15_ENET_QOS_1588_EVENT0_AUX_IN	0x0250 0x0494 0x0000 0x8 0x0
#define IMXRT117X_PAD_DISP_B2_15_LPSPI4_PCS0		0x0250 0x0494 0x060C 0x9 0x1
#define IMXRT117X_PAD_DISP_B2_15_GPIO11_IO16		0x0250 0x0494 0x0000 0xA 0x0

#endif /* __DTS_IMXRT117X_PINFUNC_H */
